{
  "backend/main.mo": "Main Motoko actor defining all core data types (User, Task, List, MorningRoutine, SpendRecord, etc.) and canister state for a personal productivity app with task management, routines, earnings tracking, and access control.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence features all targeting CustomLists.tsx: fixing 1000-based order calculation on drop, fixing optimistic local state updates on cross-list drag, and ensuring backend updateTask sync with rollback on failure.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose and key implementation details, serving as a reference for the current state of all frontend components, hooks, and pages.",
  "frontend/docs/task-toggle-audit.md": "Audit document identifying why task completion toggles feel slow (no optimistic update, full query invalidation, unnecessary backend validation) and recommending the same optimistic mutation pattern used for routines.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing the temporary test date override feature used for debugging routine daily rollover logic, scoped only to routine-related logic and not other date-dependent features.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the full design token system in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the Momentum PWA with viewport-fit cover, iOS/Android PWA meta tags, manifest link, and app icons.",
  "frontend/public/manifest.json": "PWA web app manifest for Momentum defining name, theme color, standalone display mode, portrait orientation, and two icon sizes (192×512).",
  "frontend/public/sw.js": "Service worker implementing a network-first caching strategy for the Momentum PWA, with install-time pre-caching of core assets and fallback to cache or index.html on network failure.",
  "frontend/src/App.tsx": "Root React component that manages top-level view state between TaskManager and AdminDashboard, wrapping the app in ThemeProvider, Toaster, and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "An empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin table component that lists all users with search, pagination, and controls to promote/demote admins and change user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin dashboard component that displays overall canister storage metrics and a paginated per-user storage breakdown table with copy-to-clipboard support.",
  "frontend/src/components/admin/TierSettings.tsx": "An admin settings component for viewing and updating per-tier limits (tasks, lists, routines) for each user tier, with unlimited toggles and save per tier.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple full-screen loading spinner component displayed during authentication initialization.",
  "frontend/src/components/BottomNavigation.tsx": "Renders a bottom navigation bar with a context-sensitive center button (add task/list menu or plan mode exit), supporting long-press to switch modes, swipe gestures, and various action callbacks for settings, insights, and earnings.",
  "frontend/src/components/CreateListDialog.tsx": "Modal dialog for creating a new custom task list, with a name input field and submit/cancel actions.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file with no content.",
  "frontend/src/components/CustomLists.tsx": "Renders user-defined task lists with drag-and-drop and touch reordering support, optimistic cache updates for cross-list moves, and per-list drop indicators.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing an existing task's title, description, list assignment, urgency, importance, and completion status, with a delete option.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Renders a 2x2 Eisenhower priority matrix with four quadrant lists, supporting drag-and-drop reordering, per-quadrant drop indicators, expand/collapse, and plan mode switching.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with authentication (Internet Identity login/logout), user profile display, admin dashboard access, theme toggle, test date picker, and new-day/skipped-day reset actions.",
  "frontend/src/components/InsightsDialog.tsx": "A dialog component that displays spending insights with bar charts, filterable by daily/weekly/all-time periods, and shows balance status with color-coded indicators.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "An empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "A component for managing morning/evening routine checklists with drag-and-drop reordering, long-press to enter reorder mode, add/delete items via dialog, and collapsible/two-column display modes.",
  "frontend/src/components/OfflineIndicator.tsx": "A full-screen overlay component that listens to browser online/offline events and displays a 'You're offline' message when the network connection is lost.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "A dialog that lists payroll history records with inline editing of totals and the ability to submit pending payroll entries, sorted by date descending.",
  "frontend/src/components/PlanModeTipDialog.tsx": "A simple informational dialog that explains Plan Mode features, specifically drag-and-drop task management between lists, with a dismiss button.",
  "frontend/src/components/SettingsDialog.tsx": "A settings dialog for configuring the earnings system, allowing users to set max daily money allocations across morning routine, daily priorities, and evening routine with proportional sliders, and toggle the earnings feature on/off.",
  "frontend/src/components/SpendPlanDialog.tsx": "A dialog component for managing spending records and presets, allowing users to add custom or preset-based spend entries with confirmation, and create/edit/delete spend presets across predefined categories.",
  "frontend/src/components/TaskCard.tsx": "A memoized task card component supporting drag-and-drop (mouse and touch), long-press to enter edit mode, and actions for toggling completion, editing, and deleting tasks.",
  "frontend/src/components/TestDatePicker.tsx": "A test-only date picker dropdown that lets developers select a simulated date from the last 31 days, clearly styled with an orange 'TEST' badge to distinguish it from production UI.",
  "frontend/src/components/ThemeToggle.tsx": "A simple icon button component that toggles between light and dark themes using next-themes, displaying a sun or moon icon accordingly.",
  "frontend/src/components/TodayEarnsDialog.tsx": "A dialog that calculates and displays the user's daily income breakdown from tasks and morning/evening routines, and allows submitting a payroll entry based on the computed total.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "A landing/login screen shown to unauthenticated users, featuring app branding, feature highlights, a login button, and an admin bootstrap URL display with copy functionality when an admin token is present in the URL.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog for creating tasks either via Eisenhower quadrant selection or a custom list, with fields for title, description, urgency, importance, and long-task flag, supporting pre-selected list targeting.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog component for viewing and editing a user's account info (name and email), with email validation and save/cancel actions.",
  "frontend/src/components/UserProfileSetup.tsx": "An onboarding card component that collects a new user's name and email to create their initial profile via the saveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status using DFINITY's AuthClient.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that tracks whether a per-user 'plan mode tip' tooltip has been shown, using localStorage with migration support from a legacy global key.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for backend interactions including user profiles, admin operations, tasks, lists, routines, payroll, spend tracking, and storage metrics.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that provides a date override mechanism stored in sessionStorage, used to simulate different dates for testing routine rollover and streak logic.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, CSS custom properties for light/dark theme tokens, and utility classes for drag interactions, safe-area insets, and streak animations.",
  "frontend/src/lib/types.ts": "Defines LocalTask and LocalList types that extend backend types with a localId string for React keys, plus helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for converting UserTier enum values to display labels and retrieving ordered tier lists.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that checks caller admin status and renders tabbed sections for user directory, tier settings, and storage monitoring, with an unauthorized access message for non-admins.",
  "frontend/src/pages/TaskManager.tsx": "Main page component for the Momentum app that orchestrates authentication, task/list/routine CRUD, drag-and-drop, earnings, and all dialog state. Composes all major UI components and hooks into a single page.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates Daily Priorities income by applying quadrant-based planned-weight threshold scaling (divisors of 1, 2, or 3) to completed task weights across Eisenhower Matrix quadrants.",
  "frontend/src/utils/dragPayload.ts": "Provides helpers to write and read drag-and-drop payloads (taskId + sourceListId) to/from DataTransfer using a custom MIME type with a text/plain fallback.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier-limit error messages for tasks, routines, and custom lists into user-friendly strings with extracted numeric limits.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color tokens, custom border radii, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for Momentum describing current architecture, known drag-and-drop bug (order calculation into non-empty lists), existing features, and pending fix requests."
}