{
  "backend/main.mo": "Main Motoko actor defining all core data types (User, Task, List, MorningRoutine, SpendRecord, etc.) and canister state for a personal productivity app with task management, routines, earnings tracking, and tiered user access control.",
  "feature_evidence.json": "Feature evidence report mapping three drag-and-drop task reordering features (optimistic UI with 1000-based ordering, backend sync with rollback, and visual parity) to their implementing files and test IDs.",
  "frontend-file-summaries.txt": "Catalogue of short summaries for each frontend source file, describing the purpose and key implementation details of components, hooks, pages, and styles in the React app.",
  "frontend/docs/task-toggle-audit.md": "Audit document identifying why task completion toggles feel slow (synchronous backend wait, blanket query invalidation, heavy validation) and recommending the same optimistic mutation pattern already used for routines.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing the temporary test date override feature used to debug routine daily rollover and streak logic, scoped only to routine-related files.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design token variables for light and dark themes covering colors, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML shell for the Momentum PWA, including viewport, theme-color, iOS/Android PWA meta tags, manifest link, and the root div that mounts the React app.",
  "frontend/public/manifest.json": "PWA web app manifest for Momentum defining name, display mode, theme colors, orientation, and two icon sizes (192×192 and 512×512).",
  "frontend/public/sw.js": "Service worker implementing a network-first caching strategy for the Momentum PWA, with install-time pre-caching of core assets and fallback to cached responses when offline.",
  "frontend/src/App.tsx": "Root React component that manages top-level view state, switching between TaskManager and AdminDashboard, and wraps the app with ThemeProvider, Toaster, and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "An empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin table component that lists all users with search, pagination, and controls to promote/demote admins and change user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin dashboard panel that displays canister-wide storage metrics and a paginated, sortable per-user storage breakdown table.",
  "frontend/src/components/admin/TierSettings.tsx": "An admin settings component for viewing and updating per-tier limits (max tasks, lists, routines) for each user tier, with unlimited toggles.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple full-screen loading spinner component displayed while authentication and app bootstrapping are in progress.",
  "frontend/src/components/BottomNavigation.tsx": "A bottom navigation bar component that handles task/list creation, mode switching (normal vs plan mode), long-press gestures, and navigation to settings, insights, and user info panels.",
  "frontend/src/components/CreateListDialog.tsx": "A modal dialog for creating a new custom task list, with a name input field and submit/cancel actions.",
  "frontend/src/components/CreateTaskDialog.tsx": "An empty file with no content.",
  "frontend/src/components/CustomLists.tsx": "Renders user-created task lists with drag-and-drop reordering support, drop indicators, and per-list task management including add, delete, edit, and toggle-complete actions.",
  "frontend/src/components/EditTaskDialog.tsx": "A modal dialog for editing an existing task's title, description, list assignment, urgency, importance, and completion status, with a delete option.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Renders a 2x2 Eisenhower priority matrix with drag-and-drop task reordering across quadrants, drop indicators, and expand/collapse functionality.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "The app header with authentication (Internet Identity login/logout), user profile display, admin dashboard access, theme toggle, test date picker, and new-day reset functionality.",
  "frontend/src/components/InsightsDialog.tsx": "A dialog component that displays spending insights with bar charts, filterable by daily/weekly/all-time periods, and shows balance status with color-coded indicators.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "An empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "A component for managing morning/evening routine checklists with drag-and-drop reordering, long-press to enter reorder mode, add/delete items via dialog, and collapsible/two-column display modes.",
  "frontend/src/components/OfflineIndicator.tsx": "A full-screen overlay component that listens to browser online/offline events and displays a 'You're offline' message when the network is unavailable.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "A dialog that lists payroll history records with inline editing of totals and the ability to submit pending payroll entries, sorted by date descending.",
  "frontend/src/components/PlanModeTipDialog.tsx": "A simple informational dialog that explains Plan Mode features, specifically drag-and-drop task management between lists, with a dismiss button.",
  "frontend/src/components/SettingsDialog.tsx": "A settings dialog for configuring the earnings system, including sliders for max daily money allocation split across morning routine, daily priorities, and evening routine, with a toggle to enable/disable earnings.",
  "frontend/src/components/SpendPlanDialog.tsx": "A dialog component for managing spending records and presets, allowing users to add custom or quick-add (preset-based) spend entries with confirmation, and create/edit/delete spend presets across predefined categories.",
  "frontend/src/components/TaskCard.tsx": "A memoized task card component supporting drag-and-drop (mouse and touch with long-press), edit mode toggling, task completion, and delete actions within a kanban-style list.",
  "frontend/src/components/TestDatePicker.tsx": "A test-only date picker dropdown that lets developers select a simulated date from the last 31 days for routine system debugging, visually distinguished with an orange 'TEST' label.",
  "frontend/src/components/ThemeToggle.tsx": "A simple icon button component that toggles between light and dark themes using next-themes, displaying a sun or moon icon accordingly.",
  "frontend/src/components/TodayEarnsDialog.tsx": "A dialog that calculates and displays the user's daily income breakdown from tasks and morning/evening routines, and allows submitting a payroll entry with the computed total.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "A landing/login screen shown to unauthenticated users, featuring app branding, feature highlights, registered user count, and an optional admin bootstrap URL display with copy functionality.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog for creating tasks either via Eisenhower quadrant selection (urgent/important toggles) or by choosing a custom list, with fields for title, description, and long-task flag.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog component for viewing and editing a user's account info (name and email), with email validation and save/cancel actions.",
  "frontend/src/components/UserProfileSetup.tsx": "An onboarding card component that collects a new user's name and email to create their initial profile via the saveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via an AuthClient wrapper.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that tracks whether a per-user 'plan mode tip' tooltip has been shown, using localStorage with migration support from a legacy global key.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, admin operations, tasks, lists, routines, spending, and payroll.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that stores a date override in sessionStorage to simulate different dates for testing routine rollover and streak logic, with a documented removal plan.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light/dark CSS custom properties for the design system, and adds utility classes for drag interactions, safe-area insets, and streak animations.",
  "frontend/src/lib/types.ts": "Defines LocalTask and LocalList types that extend backend types with a localId string for React keys, plus helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for converting UserTier enum values to display labels and retrieving ordered tier lists.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabs for user directory, tier settings, and storage monitoring, showing an unauthorized message with bootstrap instructions for non-admins.",
  "frontend/src/pages/TaskManager.tsx": "Main task manager page component that orchestrates authentication, task/list/routine CRUD, drag-and-drop, earnings, and all dialog states. Integrates numerous hooks and child components to render the full app UI.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income by scaling completed task weights per Eisenhower quadrant based on planned-weight thresholds, then multiplying by a unit derived from total planned weight.",
  "frontend/src/utils/dragPayload.ts": "Provides helpers to write and read drag-and-drop task payloads to/from DataTransfer using a custom MIME type with a text/plain fallback for cross-browser compatibility.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier-limit error messages for tasks, routines, and custom lists into user-friendly strings with extracted numeric limits.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radii, box shadows, accordion keyframes, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state metadata for the Momentum app describing the current version, architectural notes on optimistic drag-and-drop with 1000-based ordering, existing features, and no pending new feature requests."
}