{
  "backend/main.mo": "Main Motoko actor defining all data types (User, Task, List, MorningRoutine, SpendRecord, etc.) and canister logic for a personal productivity app with task management, routines, earnings tracking, and access control.",
  "feature_evidence.json": "Feature evidence report confirming implementation of a visual drop indicator line for task drag-and-drop reordering in EisenhowerMatrix, CustomLists, and TaskCard components, matching existing MorningRoutine behavior.",
  "frontend-file-summaries.txt": "Structured summaries of all frontend source files describing component responsibilities, prop interfaces, and key behavioral details for the Momentum task management app.",
  "frontend/docs/task-toggle-audit.md": "Audit document identifying latency sources in task completion toggles (synchronous backend wait, blanket query invalidation, heavy validation) and recommending optimistic updates matching the routine pattern.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing the temporary test date override feature used to debug routine daily rollover and streak logic, scoped only to routine-related files.",
  "frontend/index.css": "Root CSS file defining Tailwind base imports and OKLCH CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Momentum PWA with viewport-fit cover, iOS/Android PWA meta tags, manifest link, and app icon references.",
  "frontend/public/manifest.json": "PWA web app manifest for Momentum defining name, theme color, standalone display mode, portrait orientation, and 192/512px icon assets.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with install-time pre-caching of core assets and fallback to cached index.html for offline navigation.",
  "frontend/src/App.tsx": "Root React component that manages top-level view state switching between TaskManager and AdminDashboard, wrapped in ThemeProvider with Toaster and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty file with no content or exports.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "Admin panel component that lists all users in a paginated, searchable table and allows promoting/demoting admin roles and changing user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "Admin component that displays overall canister storage metrics and a paginated per-user storage breakdown table with copy-to-clipboard support for principals.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin component for viewing and updating per-tier limits (max tasks, lists, routines) for each user tier, with unlimited toggle switches and save-per-tier functionality.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple full-screen loading spinner component displayed during authentication initialization.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with a long-press-activated FAB menu, plan mode toggle, and action buttons for adding tasks/lists, settings, earnings, spend plan, insights, and user info.",
  "frontend/src/components/CreateListDialog.tsx": "A modal dialog component for creating a new custom task list, with a controlled text input for the list name and submit/cancel actions.",
  "frontend/src/components/CreateTaskDialog.tsx": "An empty file with no content, likely a placeholder for a task creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Renders user-defined task lists in a scrollable layout with drag-and-drop reordering support, per-list drop indicators, and actions for creating, deleting, and editing tasks and lists.",
  "frontend/src/components/EditTaskDialog.tsx": "A modal dialog for editing an existing task's title, description, list assignment, urgency, importance, and completion status, with delete support.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Renders a 2x2 Eisenhower priority matrix with drag-and-drop task reordering across quadrants, expandable view, and plan mode support.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "App header with Internet Identity authentication, user profile display, admin access, theme toggle, test date picker, and new-day reset functionality via a dropdown menu.",
  "frontend/src/components/InsightsDialog.tsx": "A dialog showing spending insights with tabbed views (spend, earning, task), time-period filtering, and a bar chart visualization of spend records.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "An empty file with no content, likely a placeholder for a monetary settings dialog component.",
  "frontend/src/components/MorningRoutine.tsx": "Renders a morning or evening routine section with drag-and-drop reordering, checkbox completion tracking, add/delete dialogs, and collapsible/two-column display modes.",
  "frontend/src/components/OfflineIndicator.tsx": "Displays a full-screen overlay when the browser loses internet connectivity, listening to the window online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog that lists payroll records sorted by date, allowing users to edit totals inline or submit pending payroll entries.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog that explains Plan Mode features such as dragging tasks between lists and reordering within a list.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring the monetary earnings system, including sliders to allocate daily money limits across morning routine, daily priorities, and evening routine categories.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for logging spending entries via quick-add presets or custom amounts, with preset management (create/edit/delete) and a confirmation step before saving.",
  "frontend/src/components/TaskCard.tsx": "A memoized task card component supporting drag-and-drop (mouse and touch), edit/delete/complete actions, and a long-press-to-edit mode for mobile, with edit state lifted to the parent via `editTaskId`/`setEditTaskId`.",
  "frontend/src/components/TestDatePicker.tsx": "A visually distinct test-only date picker dropdown that lets developers select a simulated date from the last 31 days, clearly labeled 'TEST' to avoid confusion with production UI.",
  "frontend/src/components/ThemeToggle.tsx": "A simple icon button that toggles between light and dark themes using `next-themes`, displaying a sun or moon icon based on the current theme.",
  "frontend/src/components/TodayEarnsDialog.tsx": "A dialog that calculates and displays the user's daily income breakdown from tasks and morning/evening routines, and allows submitting a payroll entry with the computed total.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "The login/landing screen shown to unauthenticated users, featuring app feature highlights, a login button, registered user count, and an admin bootstrap URL display when an admin token is present in the URL.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog for creating tasks either via Eisenhower Matrix quadrant selection or by choosing a custom list, with fields for title, description, urgency, importance, and long-task flag.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog for viewing and editing the user's account profile, specifically allowing the user to update their email address with validation and save feedback via toasts.",
  "frontend/src/components/UserProfileSetup.tsx": "A form component that collects a new user's name and email, validates inputs, and saves the profile via the `useSaveCallerUserProfile` mutation with a basic tier.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage Internet Identity authentication state, login, and logout using `@dfinity/auth-client`.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that manages whether to show a 'plan mode tip' dialog to a user, using per-user localStorage keys with migration support from a legacy global key.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks (queries and mutations) for all backend data operations including user profiles, tasks, lists, routines, monetary settings, payroll, spend records, and admin functions.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that provides a date override mechanism stored in sessionStorage, used to simulate different dates for testing routine rollover and streak logic.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/component/utility layers, CSS custom properties for light and dark themes using OKLCH colors, and utility classes for drag interactions, safe-area insets, and streak animations.",
  "frontend/src/lib/types.ts": "Defines extended local types (LocalTask, LocalList) that augment backend types with a localId string for React keys, plus helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for working with UserTier enum values, providing label strings, a full list of tiers, and the ordered tier array.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only page with tabs for user directory, tier settings, and storage monitoring; shows an unauthorized message with setup instructions if the caller is not an admin.",
  "frontend/src/pages/TaskManager.tsx": "Main application page that orchestrates task, list, routine, earnings, and spend management, rendering the appropriate UI based on authentication state and user profile, with numerous dialog components and drag-and-drop support.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates Daily Priorities income by applying quadrant-based scaling divisors (based on planned weight thresholds) to completed task weights, then multiplying by a unit derived from total planned weight.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop task payloads (taskId, sourceListId) to/from DataTransfer using a custom MIME type with a text/plain fallback.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier-limit errors for tasks, routines, and custom lists into user-friendly messages prompting upgrades.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to extract URL parameters from query strings or hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for the Momentum app, noting a pending fix request to add a visual drop indicator line to task drag-and-drop reordering to match existing routine behavior."
}