{
  "backend/main.mo": "Main Motoko actor for the Momentum app defining all data types (User, Task, List, MorningRoutine, SpendRecord, etc.) and canister state, with access control and tier-based limits for a personal task/routine management system.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (task drag-and-drop drop indicator lines, cross-container drag-and-drop, routine preservation) to their relevant source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "A JSON document summarizing the purpose and key details of each frontend source file, serving as a reference index for the frontend codebase structure.",
  "frontend/docs/task-toggle-audit.md": "Audit document analyzing latency in task completion toggles, identifying synchronous backend waits and blanket query invalidation as root causes, and recommending optimistic updates (as used for routines) as the fix.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing the temporary test date override feature used for debugging routine rollover and streak logic, scoping which files to delete or modify.",
  "frontend/index.css": "Global Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "HTML entry point for the Momentum PWA, including viewport meta tags, iOS/Android PWA support meta tags, manifest link, and the root div for the React app.",
  "frontend/public/manifest.json": "PWA web app manifest for Momentum defining app name, theme color, display mode, orientation, and icon references for 192px and 512px sizes.",
  "frontend/public/sw.js": "Service worker implementing a network-first caching strategy for the Momentum PWA, with install-time pre-caching of essential assets and fallback to cached responses when offline.",
  "frontend/src/App.tsx": "Root React component that manages top-level view state, switching between TaskManager and AdminDashboard, and wraps the app with ThemeProvider, Toaster, and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "An empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin table component that lists all users with search, pagination, and controls to promote/demote admins and change user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin dashboard component that displays overall canister storage metrics and a paginated per-user storage breakdown table with copy-to-clipboard support.",
  "frontend/src/components/admin/TierSettings.tsx": "An admin settings component for viewing and updating per-tier limits (tasks, lists, routines) with unlimited toggles and save functionality for each user tier.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple full-screen loading spinner component displayed during authentication initialization.",
  "frontend/src/components/BottomNavigation.tsx": "A bottom navigation bar component that handles task/list creation, mode switching (normal/plan), long-press gestures, and navigation to settings, insights, and user info panels.",
  "frontend/src/components/CreateListDialog.tsx": "A modal dialog for creating a new named task list, with a text input, submit/cancel buttons, and loading state support.",
  "frontend/src/components/CreateTaskDialog.tsx": "An empty file with no content.",
  "frontend/src/components/CustomLists.tsx": "Renders user-defined (non-quadrant) task lists with drag-and-drop reordering and cross-list task movement, plus optimistic UI updates and list deletion support.",
  "frontend/src/components/EditTaskDialog.tsx": "A modal dialog for editing an existing task's title, description, list assignment, urgency/importance flags, and completion status, with delete functionality.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Renders a four-quadrant Eisenhower priority matrix with drag-and-drop support for moving and reordering tasks between quadrants, including optimistic UI updates.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "The app header with authentication (Internet Identity login/logout), user profile display, admin dashboard access, theme toggle, test date picker, and new-day reset functionality.",
  "frontend/src/components/InsightsDialog.tsx": "A dialog component that displays spending and earning insights with bar charts, supporting daily/weekly/all-time filtering and balance status indicators.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "An empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "A component for managing morning/evening routine checklists with drag-and-drop reordering, long-press to enter reorder mode, add/delete dialogs, and collapsible/two-column display modes.",
  "frontend/src/components/OfflineIndicator.tsx": "A full-screen overlay component that listens to browser online/offline events and displays a 'You're offline' message when the network is unavailable.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "A dialog that lists payroll history records with inline editing of totals and the ability to submit pending payroll entries, sorted by date descending.",
  "frontend/src/components/PlanModeTipDialog.tsx": "A simple informational dialog that explains Plan Mode features, specifically drag-and-drop task management between lists, with a dismiss button.",
  "frontend/src/components/SettingsDialog.tsx": "A settings dialog for configuring the monetary earnings system, including sliders for daily money limits distributed across morning routine, daily priorities, and evening routine, plus a toggle to enable/disable earnings.",
  "frontend/src/components/SpendPlanDialog.tsx": "A dialog component for managing spending records and presets, allowing users to add custom or preset-based spends with confirmation, and create/edit/delete spend presets with category selection.",
  "frontend/src/components/TaskCard.tsx": "A draggable task card component that supports toggling completion, inline editing, long-press to edit, and drag-and-drop reordering with above/below drop indicators.",
  "frontend/src/components/TestDatePicker.tsx": "A test-only date picker dropdown that lets developers select a simulated date from the last 31 days for routine system debugging, styled distinctively with an orange 'TEST' label.",
  "frontend/src/components/ThemeToggle.tsx": "A simple button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with CSS transition animations.",
  "frontend/src/components/TodayEarnsDialog.tsx": "A dialog that calculates and displays the user's daily income breakdown from tasks and morning/evening routines, with a button to submit payroll and access payroll history.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "A landing/login screen shown to unauthenticated users, displaying app features, a login button, registered user count, and an admin bootstrap URL section when an admin token is present in the URL.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog for creating tasks either via Eisenhower Matrix quadrant selection or a custom list, with fields for title, description, urgency, importance, and long-task flags.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog component for viewing and editing a user's account info (name and email), with email validation and save/cancel actions.",
  "frontend/src/components/UserProfileSetup.tsx": "An onboarding card component that collects a new user's name and email to create their initial profile via the saveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous backend actor using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity persistence via AuthClient. Exposes status flags and identity state to child components through InternetIdentityProvider.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that manages whether a 'plan mode tip' should be shown to a user, using per-user localStorage keys with migration support from a legacy global key.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for fetching and mutating backend data including tasks, lists, routines, monetary settings, user profiles, and admin data via the actor interface.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that provides a date override mechanism stored in sessionStorage for simulating different dates when testing routine daily rollover and streak logic.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, CSS custom properties for light and dark themes, and shared utility classes for animations, scrollbars, and drop indicators.",
  "frontend/src/lib/types.ts": "Defines LocalTask and LocalList types extending backend types with a localId string, plus helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for converting UserTier enum values to display labels and retrieving ordered tier lists.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that checks caller admin status and renders tabbed sections for user directory, tier settings, and storage monitoring, with an unauthorized access message for non-admins.",
  "frontend/src/pages/TaskManager.tsx": "Main page component that orchestrates the full task management UI, including authentication state, task/routine queries, modals (settings, earnings, spend, insights), and navigation between Eisenhower matrix, custom lists, and morning routine views.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income by applying quadrant-based planned-weight threshold scaling (divisors of 1, 2, or 3) to completed task weights across the four Eisenhower matrix quadrants.",
  "frontend/src/utils/dragPayload.ts": "Provides read/write utilities for task and routine drag-and-drop payloads using MIME types, with fallback to text/plain for cross-browser compatibility.",
  "frontend/src/utils/tierErrors.ts": "Normalizes raw backend error messages (tier limits, Motoko trap messages) into user-friendly strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot documenting the app's architecture, existing features (drag-and-drop, streak system, daily reset), and known issues at schema version 1.0.0."
}