{
  "backend/main.mo": "Main Motoko actor defining all core data types (User, Task, List, MorningRoutine, SpendRecord, etc.) and canister state for a personal productivity app with task management, routines, spending tracking, payroll, and tier-based access control.",
  "feature_evidence.json": "Feature evidence report confirming that safe-area-aware top padding (using `env(safe-area-inset-top)`) was implemented in Header.tsx and index.css to prevent content clipping in fullscreen/standalone PWA mode.",
  "frontend-file-summaries.txt": "Auto-generated summary document describing the purpose and key implementation details of each frontend source file in the project.",
  "frontend/docs/task-toggle-audit.md": "Audit document analyzing the latency sources in task completion toggles, identifying the lack of optimistic updates (unlike routines) as the primary cause, and recommending applying the same optimistic mutation pattern used for routines.",
  "frontend/docs/test-date-removal-plan.md": "Developer guide outlining steps to remove the temporary test date override feature used for debugging routine rollover and streak logic, scoping which files to delete or modify.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite app with PWA meta tags, iOS and Android standalone mode support, manifest link, and viewport-fit=cover for notch-aware layout.",
  "frontend/public/manifest.json": "PWA web app manifest for the Momentum app defining display mode (standalone), theme colors, icons, and orientation.",
  "frontend/public/sw.js": "Service worker implementing a network-first caching strategy for PWA offline support, caching essential assets on install and cleaning up old caches on activate.",
  "frontend/src/App.tsx": "Root React component that manages top-level view state to switch between the TaskManager and AdminDashboard pages, wrapped with ThemeProvider, Toaster, and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "An empty file with no content or exports.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin table component that lists all users with search, pagination, and controls to promote/demote admins and change user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin dashboard panel that displays overall canister storage metrics and a paginated per-user storage breakdown table with copy-to-clipboard support.",
  "frontend/src/components/admin/TierSettings.tsx": "An admin settings component for configuring per-tier limits (tasks, lists, routines) with unlimited toggles and save functionality for each user tier.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple full-screen loading spinner component displayed while authentication is initializing.",
  "frontend/src/components/BottomNavigation.tsx": "A bottom navigation bar component that handles task/list creation, mode switching (normal vs plan mode), long-press gestures, and navigation to settings, insights, and user info panels.",
  "frontend/src/components/CreateListDialog.tsx": "A modal dialog for creating a new custom task list, accepting a name input and calling a callback on submit.",
  "frontend/src/components/CreateTaskDialog.tsx": "An empty file with no content.",
  "frontend/src/components/CustomLists.tsx": "Renders user-created task lists with drag-and-drop and touch reordering support, plus buttons to add tasks and new lists.",
  "frontend/src/components/EditTaskDialog.tsx": "A modal dialog for editing an existing task's title, description, list assignment, urgency, importance, and completion status.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Renders a collapsible Eisenhower priority matrix with four quadrants, supporting drag-and-drop task reordering and a plan mode toggle.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A sticky app header with the Momentum logo, current date display, theme toggle, admin access, and Internet Identity login/logout functionality.",
  "frontend/src/components/InsightsDialog.tsx": "A dialog component that displays spending and earning insights with bar charts, supporting daily/weekly/all-time filtering and balance status indicators.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "An empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "A component for managing morning/evening routine checklists with drag-and-drop reordering, add/delete dialogs, long-press detection, and collapsible two-column display modes.",
  "frontend/src/components/OfflineIndicator.tsx": "A full-screen overlay component that listens to browser online/offline events and displays a 'You're offline' message when the network is unavailable.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "A dialog that lists payroll history records with inline editing and submission actions, fetched via a custom hook and displayed in a scrollable list.",
  "frontend/src/components/PlanModeTipDialog.tsx": "A simple informational dialog that explains Plan Mode features such as drag-and-drop task management between lists.",
  "frontend/src/components/SettingsDialog.tsx": "A settings dialog for configuring the monetary earnings system, including sliders for daily money allocation across morning routine, daily priorities, and evening routine, plus a toggle to enable/disable earnings.",
  "frontend/src/components/SpendPlanDialog.tsx": "A dialog component for managing spending records and presets, allowing users to add custom or preset-based spend entries with confirmation, and create/edit/delete spend presets by category.",
  "frontend/src/components/TaskCard.tsx": "A memoized task card component supporting drag-and-drop (mouse and touch) reordering, with edit/delete/complete actions and long-press to enter edit mode on mobile.",
  "frontend/src/components/TestDatePicker.tsx": "A test-only date picker dropdown that lets developers select a simulated date from the last 31 days for routine system debugging, styled distinctively with an orange 'TEST' label.",
  "frontend/src/components/ThemeToggle.tsx": "A simple button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with CSS transition animations.",
  "frontend/src/components/TodayEarnsDialog.tsx": "A dialog that calculates and displays the user's daily income breakdown from tasks and morning/evening routines, with a button to submit payroll and access payroll history.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "A landing/login screen shown to unauthenticated users, displaying app features, a login button, registered user count, and an admin bootstrap URL section when an admin token is present in the URL.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog for creating tasks either via Eisenhower quadrant selection (urgent/important toggles) or by choosing a custom list, with fields for title, description, and long-task flag.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog component for viewing and editing a user's account info (name and email), with email validation and save/cancel actions.",
  "frontend/src/components/UserProfileSetup.tsx": "An onboarding card component that collects a new user's name and email to create their initial profile via the saveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via an `InternetIdentityProvider` wrapper component.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that tracks whether a per-user 'plan mode tip' tooltip has been shown, using localStorage with migration support from a legacy global key.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend actor calls, covering user profiles, admin management, tier limits, tasks, lists, routines, payroll, and spend tracking.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that provides a date override mechanism stored in sessionStorage, used to simulate different dates for testing routine rollover and streak logic.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS, defines light/dark CSS custom properties for the design system, and adds utility classes for drag interactions, safe-area insets, and streak animation effects.",
  "frontend/src/lib/types.ts": "Defines `LocalTask` and `LocalList` types that extend backend types with a `localId` string for React keys, along with helper conversion functions.",
  "frontend/src/lib/userTier.ts": "Utility functions for converting `UserTier` enum values to display labels and retrieving ordered tier lists.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabs for user directory, tier settings, and storage monitoring, showing an unauthorized message with bootstrap instructions if the caller lacks admin privileges.",
  "frontend/src/pages/TaskManager.tsx": "Main task manager page component that orchestrates all app state, dialogs, and views (Eisenhower matrix, custom lists, morning routine) using hooks for queries, authentication, and UI state management.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income by applying quadrant-based planned-weight threshold scaling to completed task weights, then multiplying by a unit derived from total planned weight.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop payloads (taskId, sourceListId) to/from DataTransfer using a custom MIME type with a text/plain fallback for compatibility.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier-limit error messages for tasks, routines, and custom lists into user-friendly strings with extracted limit values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the Momentum task app's current implementation status, known issues (2s+ drag-and-drop delay), and pending feature requests for optimistic UI drag-and-drop and visible drop indicators."
}