{
  "backend/main.mo": "Main Motoko actor for the Momentum app defining all data types (User, Task, List, MorningRoutine, SpendRecord, etc.) and canister state, with access control and user management logic.",
  "feature_evidence.json": "Feature evidence report linking the Skipped Day Reset frontend fix (cache invalidation for routines/streak data) to its implementation files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files describing component responsibilities, prop interfaces, and key implementation details for build planning reference.",
  "frontend/docs/task-toggle-audit.md": "Audit document identifying latency sources in task completion toggles (no optimistic updates, full query invalidation, heavy backend validation) and recommending the optimistic mutation pattern used by routines.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing the temporary test date override feature that was used to debug routine daily rollover and streak logic.",
  "frontend/index.css": "Root CSS file defining Tailwind base imports and OKLCH CSS custom properties for the light and dark color themes.",
  "frontend/index.html": "HTML entry point for the Momentum PWA with viewport, theme-color, iOS/Android PWA meta tags, manifest link, and root div.",
  "frontend/public/manifest.json": "PWA web app manifest for Momentum defining name, display mode, theme colors, orientation, and icon assets.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with install/activate cache management and offline fallback to index.html.",
  "frontend/src/App.tsx": "Root React component that manages top-level view state, switching between TaskManager and AdminDashboard, and renders the ThemeProvider, Toaster, and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "An empty file with no content or exports.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin panel component that lists all users in a searchable, paginated table, allowing admins to promote/demote users and change their subscription tier.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin dashboard component that displays overall canister storage metrics and a paginated per-user storage breakdown table with copy-to-clipboard support for principal IDs.",
  "frontend/src/components/admin/TierSettings.tsx": "An admin settings component for configuring per-tier limits (max tasks, lists, routines) for each user tier, with support for toggling unlimited values and saving changes to the backend.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple full-screen loading spinner component displayed during authentication initialization.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with a central FAB supporting long-press to switch plan mode, swipe gestures, animated menu expansion, and action buttons for tasks, lists, settings, earnings, and user info.",
  "frontend/src/components/CreateListDialog.tsx": "A modal dialog component for creating a new task list, with a controlled text input for the list name and submit/cancel buttons.",
  "frontend/src/components/CreateTaskDialog.tsx": "An empty file with no content or exports.",
  "frontend/src/components/CustomLists.tsx": "A memoized component that renders user-created task lists with drag-and-drop reordering, task cards, and controls to add or delete tasks and lists.",
  "frontend/src/components/EditTaskDialog.tsx": "A modal dialog for editing an existing task's title, description, list assignment, urgency, importance, and completion status, with delete support.",
  "frontend/src/components/EisenhowerMatrix.tsx": "A memoized component rendering a collapsible Eisenhower priority matrix with four quadrants, supporting drag-and-drop task placement and a plan mode toggle.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "The app header with Internet Identity authentication, user profile display, admin access, theme toggle, test date picker, and new-day reset controls.",
  "frontend/src/components/InsightsDialog.tsx": "A dialog showing spending and balance insights with tabbed views and a bar chart filtered by daily, weekly, or all-time periods using Recharts.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "An empty file with no content or exports.",
  "frontend/src/components/MorningRoutine.tsx": "Renders a collapsible Morning or Evening Routine section with drag-and-drop reordering, checkbox completion, add/delete dialogs, and a two-column display toggle.",
  "frontend/src/components/OfflineIndicator.tsx": "Displays a full-screen overlay when the browser loses internet connectivity, listening to the window online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog that lists payroll records sorted by date, allowing inline editing of totals and submission of pending payroll entries.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog that explains Plan Mode features such as dragging tasks between lists and reordering within a list.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring the monetary earnings system, including sliders for daily money caps split across morning routine, daily priorities, and evening routine sections.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for logging spending entries via quick-add presets or custom amounts, with preset management (create/edit/delete) and a confirmation step before saving.",
  "frontend/src/components/TaskCard.tsx": "A memoized task card component supporting drag-and-drop (mouse and touch), edit/delete/complete actions, and a long-press-to-edit mode for mobile, with edit state lifted to the parent via `editTaskId`/`setEditTaskId`.",
  "frontend/src/components/TestDatePicker.tsx": "A visually distinct test-only date picker dropdown that lets developers select a simulated date from the last 31 days, clearly labeled 'TEST' to avoid confusion with production UI.",
  "frontend/src/components/ThemeToggle.tsx": "A simple icon button that toggles between light and dark themes using `next-themes`, displaying a Sun or Moon icon based on the current theme.",
  "frontend/src/components/TodayEarnsDialog.tsx": "A dialog that calculates and displays the user's daily income breakdown from tasks and morning/evening routines, and allows submitting payroll with the computed total.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "The login/landing screen shown to unauthenticated users, featuring app feature highlights, a login button, registered user count, and an admin bootstrap URL display when an admin token is present in the URL.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog for creating tasks with two tabs: one for placing tasks into Eisenhower Matrix quadrants based on urgency/importance toggles, and one for adding tasks to custom lists.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog for viewing and editing the user's account profile, specifically allowing the user to update their email address with validation.",
  "frontend/src/components/UserProfileSetup.tsx": "A form component for new users to enter their name and email to create a profile, with validation and submission via the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that manages whether to show a 'plan mode tip' dialog to a user, using per-user localStorage keys with migration from a legacy global key.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks (queries and mutations) for all backend data operations including user profiles, tasks, lists, routines, monetary settings, payroll, spend records, and admin functions.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that provides a date override mechanism stored in sessionStorage, used to simulate different dates for testing routine rollover and streak logic.",
  "frontend/src/index.css": "Global CSS file that defines Tailwind base/component/utility layers, OKLCH-based CSS custom properties for light and dark themes, and custom utility classes including drag-over styles, text-selection control, safe-area insets, and streak animation effects.",
  "frontend/src/lib/types.ts": "Defines LocalTask and LocalList types that extend backend types with a localId string for React keys, plus helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for working with UserTier enum values, providing label strings, a full list of tiers, and the ordered tier array.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only page with tabs for user directory, tier settings, and storage monitoring; shows an unauthorized state with setup instructions if the caller is not an admin.",
  "frontend/src/pages/TaskManager.tsx": "Main application page that orchestrates task, list, routine, earnings, and spend management, handling authentication state and rendering the appropriate UI components and dialogs.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates Daily Priorities income by applying quadrant-based scaling divisors to completed task weights, then multiplying by a unit derived from total planned weight across all quadrants.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop task payloads to/from DataTransfer using a custom MIME type with a text/plain fallback for compatibility.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier-limit error messages for tasks, routines, and custom lists into user-friendly strings with upgrade prompts.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to extract URL parameters from query strings or hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radii, accordion keyframes, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state for the Momentum habit tracker app, noting a known issue where the Skipped Day Reset button fails to uncheck boxes or reset the streak, with pending backend and frontend fix requests."
}