{
  "kind": "build_request",
  "title": "Fix Skipped Day Reset to uncheck all boxes and reset streak to 0",
  "projectName": "Momentum",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Skipped Day Reset backend logic so that when a user triggers a skipped day reset, all morning and evening routine checkbox states are set to unchecked (false) and the streak counter is reset to 0.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "skipped day reset does not work",
          "all box not uncheck",
          "the count streak does not reset to 0"
        ]
      },
      "acceptanceCriteria": [
        "Calling the skipped day reset endpoint sets all routine item checked states to false (unchecked).",
        "Calling the skipped day reset endpoint resets the streak counter to 0.",
        "The reset persists after subsequent page loads or re-queries."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the Skipped Day Reset frontend handler in the Start New Day dialog so that after the reset mutation completes, the UI reflects all checkboxes as unchecked and the streak count displayed as 0 — by invalidating or updating the relevant React Query caches for routines and streak data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "skipped day reset does not work",
          "all box not uncheck",
          "the count streak does not reset to 0"
        ]
      },
      "acceptanceCriteria": [
        "After clicking Skipped Day Reset, all routine checkboxes immediately appear unchecked in the UI.",
        "After clicking Skipped Day Reset, the streak count displayed in the UI shows 0.",
        "The UI state is consistent with a fresh re-fetch from the backend."
      ]
    }
  ],
  "constraints": [
    "Do not change any immutable frontend paths (hooks/useInternetIdentity.ts, hooks/useActor.ts, main.tsx, components/ui).",
    "All Motoko logic must remain in the single main actor file (backend/main.mo)."
  ],
  "nonGoals": [
    "Adding a confirmation prompt before the reset triggers.",
    "Changing any other reset or new-day logic beyond the Skipped Day Reset path.",
    "Modifying task or list state as part of this reset."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}