{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add drop indicator line to task drag-and-drop reordering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add visual drop indicator line to task drag-and-drop reordering matching MorningRoutine.tsx behavior",
      "acceptanceCriteria": [
        "When dragging a task over a valid drop target within a task list, a visible indicator line appears between task items showing the insertion position.",
        "The indicator line updates dynamically as the user drags over different positions in the list.",
        "The indicator line disappears when the drag ends (drop or cancel).",
        "The drop indicator line visual style matches the existing drop indicator line used in MorningRoutine.tsx for routine items.",
        "The indicator line works in all task container contexts: Eisenhower Matrix quadrants and Custom Lists.",
        "Existing task drag-and-drop reorder functionality continues to work correctly after the change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Add drop indicator line state and rendering logic to TaskCard component. Mirror the pattern from MorningRoutine.tsx routine items: add local state to track when the card is a drag-over target, add onDragEnter/onDragLeave/onDrop handlers to manage indicator visibility, and render a visual indicator line (similar styling to routine drop indicator) above or below the card based on drag position. Ensure the indicator clears on drag end and does not interfere with existing drag-and-drop reorder functionality."
        },
        {
          "path": "frontend/src/components/EisenhowerMatrix.tsx",
          "operation": "modify",
          "description": "Update EisenhowerMatrix quadrant rendering to support drop indicator line display. Ensure that each quadrant's task list container properly propagates drag events to TaskCard components and that the indicator line is visible within the quadrant boundaries. Verify that existing drag-and-drop reorder logic continues to work correctly with the new indicator."
        },
        {
          "path": "frontend/src/components/CustomLists.tsx",
          "operation": "modify",
          "description": "Update CustomLists task rendering to support drop indicator line display. Ensure that each custom list's task container properly propagates drag events to TaskCard components and that the indicator line is visible within the list boundaries. Verify that existing drag-and-drop reorder logic continues to work correctly with the new indicator."
        }
      ]
    }
  ]
}