{
  "backend/main.mo": "Defines the core backend actor with user data models, task/list/routine types, monetary settings, and access-control state.",
  "feature_evidence.json": "Contains feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries of key frontend files describing components, hooks, layouts, and behaviors.",
  "frontend/docs/task-toggle-audit.md": "Explains latency issues in task completion toggles and identifies causes such as synchronous waits and full refetches.",
  "frontend/index.css": "Defines global CSS variables and light/dark theme styles using Tailwind layers.",
  "frontend/index.html": "Base HTML document configuring PWA metadata, icons, manifest, and root mounting element.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, colors, icons, and display settings.",
  "frontend/public/sw.js": "Service worker implementing caching, activation cleanup, and network‑first fetch handling.",
  "frontend/src/App.tsx": "Root React component providing theme context and rendering TaskManager, toasts, and offline indicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Admin UI for searching, viewing, promoting, and demoting users with pagination support.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Full‑screen loading indicator shown during authentication bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation component with plan‑mode switching, long‑press detection, and action menu controls.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating a new list with a name input and submit handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file content provided.",
  "frontend/src/components/CustomLists.tsx": "Renders and manages custom task lists with drag-and-drop, creation, deletion, and task interactions.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task details including title, description, list, and properties.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays Eisenhower Matrix quadrants with drag-and-drop task management and expand/collapse behavior.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link.",
  "frontend/src/components/Header.tsx": "Header with branding, date display, auth controls, theme toggle, and admin access.",
  "frontend/src/components/InsightsDialog.tsx": "Analytics dialog showing spend insights with charts and time filters.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file content provided.",
  "frontend/src/components/MorningRoutine.tsx": "Renders and manages morning/evening routine lists with adding, deleting, completing, drag-and-drop reordering, and display modes.",
  "frontend/src/components/OfflineIndicator.tsx": "Displays a full-screen offline notice when the browser loses network connectivity.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Shows payroll history with editing, submitting entries, and formatted date display inside a dialog.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a settings dialog to configure monetary limits and toggle earnings with validation and dynamic recalculation.",
  "frontend/src/components/SpendPlanDialog.tsx": "Handles creating, deleting, and confirming spend entries and presets within a scrollable dialog.",
  "frontend/src/components/TaskCard.tsx": "Represents a draggable and touch-friendly task card with edit, delete, and complete actions.",
  "frontend/src/components/ThemeToggle.tsx": "A button that switches between light and dark themes using next-themes.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Displays daily earnings calculations from tasks and routines and allows submitting payroll with history view support.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Shows a branded login screen prompting users to sign in with Internet Identity.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Provides a dialog to create tasks in quadrants or custom lists with inputs for task metadata.",
  "frontend/src/components/UserProfileSetup.tsx": "Collects a user's name to create an initial profile with default settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook handling login, stored identity restoration, and state management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profile, admin actions, app mode, and various data entities.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables plus animations for themes and streak effects.",
  "frontend/src/lib/types.ts": "Defines local React-friendly task and list types and helpers to convert to and from backend types.",
  "frontend/src/lib/userTier.ts": "Maps backend UserTier enum values to human-readable labels.",
  "frontend/src/main.tsx": "App entry point initializing QueryClient and Internet Identity provider before rendering App.",
  "frontend/src/pages/TaskManager.tsx": "Main task manager page orchestrating authentication, profile loading, tasks, routines, settings, and various UI dialogs.",
  "frontend/src/utils/dragPayload.ts": "Provides helpers to write and read stable drag-and-drop payloads with fallback MIME types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins with custom OKLCH variables.",
  "project_state.json": "Defines the project’s versioned state plus a comprehensive list of implemented features covering authentication, actor initialization, secret handling, RBAC, and admin tools. Each feature entry includes IDs, descriptions, synonyms, and version metadata for planning and tracking."
}