{
  "backend/main.mo": "Main Motoko actor defining all data types (User, Task, List, MorningRoutine, PayrollRecord, SpendRecord, UserProfile, UserTier, TierLimits), state management with Maps for users/profiles/access control, and public query/update functions for task management, routine operations, payroll, spending, admin controls, and tier-based feature limits.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Reset New Day button in Header, frontend-only routine check/uncheck with optimistic UI, strike count preview logic, manual reset workflow, and React Query mutation hooks for daily reset operations.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx, TaskManager.tsx with drag-and-drop and manual reset, useQueries.ts with all backend hooks including manualResetRoutines mutation, Header.tsx with Reset New Day button, and component descriptions for EisenhowerMatrix, CustomLists, TaskCard with CSS truncation, dialogs, and styling configurations.",
  "frontend/docs/task-toggle-audit.md": "Audit document analyzing task completion toggle latency, identifying synchronous backend wait and blanket query invalidation as primary issues, comparing with instant routine toggles that use optimistic updates, and recommending applying the same optimistic mutation pattern to tasks.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing temporary test date override feature used for debugging routine system bugs, clarifying it only affects routine-related logic (completion checks, streaks, daily rollover) and not task/payroll/spend timestamps.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH color system defining comprehensive CSS custom properties for light/dark themes including background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS and Android app support configuration, manifest link, apple-touch-icons, theme-color, and viewport settings for mobile-first responsive design.",
  "frontend/public/manifest.json": "PWA manifest defining app name, start URL, standalone display mode, theme colors, orientation, and icon configurations for 192x192 and 512x512 sizes with maskable purpose.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with CACHE_NAME versioning, install event caching essential resources, activate event cleaning old caches, and fetch event with network-first fallback to cache for offline support.",
  "frontend/src/App.tsx": "Root application component managing view state to switch between TaskManager and AdminDashboard, wrapped with ThemeProvider for dark mode support, including Toaster for notifications and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "Admin panel component displaying a paginated, searchable table of users with controls to promote/demote admins and change user tiers. Includes principal ID copying and enforces admin limits.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin interface for configuring tier limits (max tasks, custom lists, routines) for each user tier (basic, silver, gold, diamond). Supports unlimited values and persists changes to backend.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Loading screen component displaying centered spinner with gradient background and 'Loading...' text, shown during authentication bootstrap phase.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with mode switching (normal/plan), menu toggle, and action buttons for tasks, lists, settings, earnings, and insights. Implements touch gestures including long-press detection and swipe-up menu with debouncing.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating new custom lists with a name input field and form submission handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file placeholder for task creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Displays custom user-created lists with tasks, supporting drag-and-drop reordering, task management (add/edit/delete), and list deletion with confirmation for non-empty lists.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task properties including title (20 char limit), description, list assignment, urgency/importance flags, long-task status, and completion state with conditional UI based on list type.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays the Eisenhower Matrix with four quadrants (Must/Should/Delegate/May Do) for task prioritization, supporting drag-and-drop, expand/collapse functionality, and a plan mode button.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with branding, date display, theme toggle, admin dashboard access, user menu with logout, test date picker, and new day reset functionality.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog component displaying spending/earning analytics with charts, time period filters (daily/weekly/all-time), and balance status indicators using Recharts for visualization.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "Component for managing routine sections (morning/evening) with collapsible lists, drag-and-drop reordering, checkbox tracking, streak counters with color-coded animations, and CRUD operations for routine items.",
  "frontend/src/components/OfflineIndicator.tsx": "Full-screen overlay component that detects and displays a message when the user loses internet connectivity using browser online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog displaying payroll history records with inline editing capabilities, submission status tracking, and formatted date/amount display sorted by date.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog explaining drag-and-drop functionality for tasks between custom lists in plan mode with a dismissible tip card.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring monetary system including max daily earnings, distribution across routine sections (morning/priorities/evening), and toggling the earnings system with validation.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for managing spending records and presets with categories (Food, Transport, etc.), including confirmation dialogs for adding spends and CRUD operations for custom presets.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component with drag-and-drop support (desktop and touch), edit mode toggle via long-press, and actions for editing, deleting, and completing tasks.",
  "frontend/src/components/TestDatePicker.tsx": "Test-only date picker dropdown displaying the last 31 days for routine debugging, with distinctive orange styling and a \"TEST\" label to indicate non-production use.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with rotation animations.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog showing daily income calculations from completed tasks and routines (morning/evening), with payroll submission functionality and access to payroll history.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing page for unauthenticated users with app features list, login button, user count display, and admin bootstrap URL copying functionality when admin token is present.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Tabbed dialog for creating tasks either in Eisenhower Matrix quadrants (urgent/important) or custom lists, with automatic quadrant prediction and long-task flagging.",
  "frontend/src/components/UserInfoDialog.tsx": "Dialog component for viewing and editing user account information (name and email). Includes email validation and handles profile updates with toast notifications.",
  "frontend/src/components/UserProfileSetup.tsx": "Initial user profile setup form that collects name and email during onboarding. Validates inputs and creates a basic tier user profile.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Configures AuthClient with custom options and derivation origin.",
  "frontend/src/hooks/usePlanModeTip.ts": "Custom hook that manages per-user localStorage state for showing a plan mode tip dialog, with migration logic from legacy global storage key to user-specific keys.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including tasks, lists, routines, payroll, spend tracking, user profiles, and admin functions with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook that allows overriding the current date for routine testing via sessionStorage, affecting only routine logic (completion, streaks, rollover) but not task or financial timestamps.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, drag-and-drop utilities, text selection controls, and GPU-accelerated streak visualization animations (shimmer, gradient, sparkle effects).",
  "frontend/src/lib/types.ts": "Defines LocalTask and LocalList types that extend backend types with React-friendly localId keys, plus conversion helpers between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for user tier management: converting UserTier enum to display labels, getting all tiers with labels, and retrieving tier ordering.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only page with tabs for user directory and tier settings, includes authorization check and bootstrap token instructions for first-time admin setup.",
  "frontend/src/pages/TaskManager.tsx": "Main task management page component that orchestrates Eisenhower matrix, custom lists, morning/evening routines, dialogs, and navigation with plan/home mode switching and drag-and-drop state.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates Daily Priorities income using quadrant-based scaling: divides completed weight by 3 (if planned <15), 2 (if <30), or 1 (if ≥30) per quadrant, then multiplies total scaled weight by a unit derived from overall planned weight.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag payloads (taskId, sourceListId) to/from DataTransfer using custom and fallback MIME types for reliable drag-and-drop operations.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier limit errors (tasks, routines, custom lists) and returns user-friendly messages with extracted limits.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended border radius, shadows, and accordion animations using typography, container-queries, and animate plugins.",
  "project_state.json": "Project state document describing a routine tracking app with manual daily reset system where check/uncheck is frontend-only preview and 'Reset New Day' button commits progress to backend."
}