{
  "backend/main.mo": "Main Motoko actor defining user data structures (tasks, routines, lists, payroll, spend records), tier-based limits, access control integration, and all backend business logic for task management, routine tracking, and monetary settings.",
  "backend/migration.mo": "Migration module with a single run function that currently performs no transformations, returning the input state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting four completed features related to replacing the 'Reset New Day' button with a 'Start New Day' dialog containing 'Next Day Reset' and 'Skipped Day Reset' options.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, pages, and configuration files with details on their responsibilities and key features.",
  "frontend/docs/task-toggle-audit.md": "Technical audit documenting latency issues in task completion toggles caused by synchronous backend waits and blanket query invalidation, contrasting with instant-feeling routine toggles that use optimistic updates.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing the temporary test date override feature used for debugging routine system logic, clarifying its scope affects only routine-related operations.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system variables for light and dark themes, including comprehensive design tokens for UI components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS/Android app support configuration, viewport settings for notched devices, and manifest/icon references.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, display mode (standalone), theme colors, orientation (portrait-primary), and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with fallback to cache, handling install/activate lifecycle events and cache versioning.",
  "frontend/src/App.tsx": "Root application component managing view state to switch between TaskManager and AdminDashboard, wrapped with ThemeProvider and including Toaster and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "An empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin component displaying a paginated, searchable table of users with controls to promote/demote admin status and change user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin component showing canister storage metrics with overall memory usage progress bar and a paginated table of per-user storage breakdowns.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin UI component for configuring tier limits (maxTasks, maxCustomLists, maxRoutines) for each user tier (basic, silver, gold, diamond), with support for unlimited values and save functionality.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Loading screen component displaying a centered spinner with gradient background shown during authentication bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with mode switching (normal/plan), menu toggle, and long-press gesture handling for drag-and-drop. Provides buttons for adding tasks/lists, accessing settings, earnings, insights, and user info.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating a new custom list with a name input field and form submission handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file placeholder for a task creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Displays custom user-created lists with drag-and-drop task management, reordering, and CRUD operations. Includes buttons for adding tasks/lists and handles both normal and plan modes.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task properties including title, description, list assignment, urgency/importance flags, long-task status, and completion state with character limits and conditional field visibility.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays the four-quadrant Eisenhower Matrix (Must/Should/Delegate/May Do) with expandable view, drag-and-drop task management, color-coded quadrants, and a plan mode toggle button.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, authentication controls (login/logout), admin dashboard access, theme toggle, optional test date picker, and 'Start New Day' button with responsive date display.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog component displaying spending and earning insights with charts, time period filters (daily/weekly/all-time), and balance status indicators using Recharts for visualization.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "Component for managing morning/evening routine items with drag-and-drop reordering, add/delete functionality, display mode toggle (single/two-column), and checkbox tracking for completed routines.",
  "frontend/src/components/OfflineIndicator.tsx": "Full-screen overlay component that detects and displays a message when the user loses internet connectivity using browser online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog displaying payroll history records with inline editing capability, submission status tracking, and sorted chronological display of payroll entries.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog that provides tips for using Plan Mode, specifically explaining drag-and-drop functionality for organizing tasks between lists.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring monetary system parameters including max daily earnings, distribution across morning/evening routines and priorities, with earnings system toggle and automatic proportional adjustments.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog component for managing spending records and presets with categories, amounts, and confirmation flows. Supports creating, editing, and deleting both individual spends and reusable presets with pre-deducted spend type handling.",
  "frontend/src/components/StartNewDayDialog.tsx": "Dialog offering two day reset options: 'Next Day Reset' (unchecks routines and updates streaks) and 'Skipped Day Reset' (unchecks routines and resets all streaks to zero).",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component with drag-and-drop support for both desktop and mobile (touch events with long-press detection). Includes edit mode, completion toggle, and delete functionality.",
  "frontend/src/components/TestDatePicker.tsx": "Test-only date picker component for routine debugging that displays the last 31 days in a dropdown with distinctive orange styling and 'TEST' label to indicate non-production feature.",
  "frontend/src/components/ThemeToggle.tsx": "Simple theme toggle button component that switches between light and dark modes using next-themes, displaying sun/moon icons with rotation animations.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog displaying daily income calculations from completed tasks and routines (morning/evening) with quadrant-weight scaling for Daily Priorities. Includes payroll submission and history access.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing page for unauthenticated users showing app features, registered user count, and login button. Includes admin bootstrap URL display with copy functionality when admin token is present in URL.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog component for creating tasks with two modes: quadrant-based (urgent/important matrix) and custom list selection, including support for long tasks and pre-selected lists.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog component for viewing and editing user profile information, specifically name (read-only) and email address with validation.",
  "frontend/src/components/UserProfileSetup.tsx": "An onboarding component that displays a full-screen card for new users to set up their profile with name and email validation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing it with Internet Identity and admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality, identity state management, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook that manages per-user localStorage state for showing a plan mode tip once, with migration support from legacy global key to user-specific keys based on principal ID.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend API calls including user profiles, tasks, lists, routines, payroll, spending, admin operations, tier management, and storage metrics.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook for overriding the current date in routine-related logic (completion checks, streaks, rollover) to facilitate testing without waiting for actual day boundaries; persists to sessionStorage.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for light/dark themes, utility classes for drag-and-drop, text selection control, safe area support, and streak visualization animations.",
  "frontend/src/lib/types.ts": "Type definitions and helper functions for extending backend Task and List types with local React keys (localId) and converting between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Provides utility functions to convert UserTier enum values to display labels, retrieve all available tiers, and get tier ordering for the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with authorization checks, displaying tabs for user directory, tier settings, and storage monitoring. Shows unauthorized message with bootstrap token instructions for non-admin users.",
  "frontend/src/pages/TaskManager.tsx": "Main task management page that orchestrates authentication, user profile setup, task/list CRUD operations, morning routines, earnings system, and various dialogs for task management and settings.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income using quadrant-based planned-weight threshold scaling with divisors (3, 2, or 1) based on planned weight thresholds (15, 30) per quadrant.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop payloads to/from DataTransfer using custom and fallback MIME types for reliable task dragging across lists.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier limit error messages for tasks, routines, and custom lists, extracting limits and returning user-friendly error messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state for a routine tracking app called 'Momentum' that tracks implementation of a new 'Start New Day' popup dialog feature with two reset options (Next Day Reset and Skipped Day Reset). Four features are already implemented, and four feature requests remain pending for completing the reset functionality."
}