{
  "backend/main.mo": "Defines the backend actor with user profiles, tasks, lists, routines, payroll structures, spend tracking, and authorization mixin, including all related types and initial state maps.",
  "feature_evidence.json": "Feature evidence report describing a UI change for Plan mode's X button and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including components, hooks, pages, and styles.",
  "frontend/docs/task-toggle-audit.md": "Audit documenting latency causes in task completion toggling and recommending optimistic updates to improve responsiveness.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light/dark themes and base element styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and mounting root for the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying name, icons, colors, and display settings.",
  "frontend/public/sw.js": "Service worker implementing caching, activation cleanup, and network-first fetch strategy with offline fallback.",
  "frontend/src/App.tsx": "Root React component providing theme context, rendering TaskManager, toast system, and offline indicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Admin dialog listing users with search, pagination, and actions to promote or demote admins.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Loading screen component shown during authentication/bootstrap with a spinner and simple message.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar handling mode switching, Plan mode X behavior, long-press detection, and task/list action buttons.",
  "frontend/src/components/CreateListDialog.tsx": "Modal form for creating a new list with name input and loading state.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file with no implementation.",
  "frontend/src/components/CustomLists.tsx": "Displays and manages custom task lists with drag-and-drop, task actions, and list creation or deletion.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s fields including title, description, list assignment, and flags.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Renders the Eisenhower Matrix with draggable quadrant tasks and optional plan mode.",
  "frontend/src/components/Footer.tsx": "Simple footer showing attribution and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing logo, date, theme toggle, user menu, and admin access.",
  "frontend/src/components/InsightsDialog.tsx": "Analytics dialog showing spend charts, balance status, and time‑period filtering.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file with no implementation.",
  "frontend/src/components/MorningRoutine.tsx": "Component for displaying, adding, editing, reordering, and deleting morning or evening routine items with long‑press reorder and display mode toggling.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows a fullscreen offline notice when the browser is offline and hides it when reconnected.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog that lists payroll history, supports editing and submitting payroll records, and formats dates and totals.",
  "frontend/src/components/SettingsDialog.tsx": "Dialog for configuring monetary settings and toggling the earnings system with validation and proportional value adjustments.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for creating, confirming, deleting spend items and managing spend presets with category and amount inputs.",
  "frontend/src/components/TaskCard.tsx": "Task card with drag‑and‑drop and touch‑based long‑press editing, supporting completion, editing, and deletion.",
  "frontend/src/components/ThemeToggle.tsx": "Button toggling between light and dark themes using next-themes.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Computes daily earnings from tasks and routines and submits payroll, displaying results in a dialog with history access.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Shows a marketing-style login screen with app features and a button to log in via Internet Identity.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Provides a dialog to create new tasks, supporting quadrant-based or custom lists with prediction logic and form handling.",
  "frontend/src/components/UserProfileSetup.tsx": "Displays a profile setup form allowing users to enter their name and save a new profile via mutation.",
  "frontend/src/hooks/useActor.ts": "Initializes and returns a backend actor tied to the current identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks to manage Internet Identity login, stored identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profile, admin actions, app mode, and other data operations.",
  "frontend/src/index.css": "Tailwind base and custom layers defining color variables, dark mode theme, and UI animations such as streak effects.",
  "frontend/src/lib/types.ts": "Defines local task/list types with helper converters between backend and local React-friendly structures.",
  "frontend/src/lib/userTier.ts": "Maps backend user tier enums to display labels like Basic, Silver, Gold, and Diamond.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/TaskManager.tsx": "Main task management page orchestrating authentication, queries, dialogs, and UI state for tasks, routines, and settings.",
  "frontend/src/utils/dragPayload.ts": "Utility for writing and reading stable drag-and-drop payloads using custom and fallback MIME types.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom color variables, animations, plugins, and responsive design settings.",
  "project_state.json": "Tracks project version, high-level app summary, and a list of implemented features covering authentication, actor setup, secret handling, RBAC, and admin operations."
}