{
  "backend/main.mo": "Main actor implementing a task/routine/spend management system with user profiles, tier-based limits, monetary settings, payroll tracking, and access control via MixinAuthorization; includes data migration support.",
  "backend/migration.mo": "Migration module defining type schemas and a run function that resets strikeCount to 0 for all routines across all users during canister upgrades.",
  "feature_evidence.json": "Empty feature evidence report with no documented features.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including TaskManager, Header, EisenhowerMatrix, drag-and-drop support, theme management, and PWA configuration with safe-area handling for mobile devices.",
  "frontend/docs/task-toggle-audit.md": "Audit documenting latency issues in task completion toggles caused by synchronous backend waits and full query invalidation, recommending optimistic updates like those used for routines.",
  "frontend/docs/test-date-removal-plan.md": "Plan for removing temporary test date override feature used for debugging routine rollover logic, specifying scope limited to routine-related functionality only.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system variables for light/dark themes, including comprehensive design tokens for UI components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS/Android app support, viewport-fit=cover for notched devices, and manifest/icon references.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, standalone display mode, teal theme color, portrait orientation, and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with cache versioning, automatic cleanup of old caches, and offline fallback to index.html for navigation requests.",
  "frontend/src/App.tsx": "Root component managing view state between TaskManager and AdminDashboard, wrapped with ThemeProvider and including Toaster and OfflineIndicator components.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "An admin component displaying a paginated, searchable table of users with controls to promote/demote admin status and change user tiers.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "An admin component that displays canister storage metrics including overall memory usage with progress bars and a paginated breakdown of storage per user.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin UI component for configuring tier limits (tasks, lists, routines) per user tier (basic, silver, gold, diamond) with support for unlimited values and save functionality.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Loading screen component displaying a centered spinner with gradient background during authentication bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with mode switching (normal/plan), menu toggle, and action buttons (add task, add list, settings, earnings, etc.). Handles touch gestures including long-press to switch modes and swipe-up to open menu.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating a new custom list with a name input field and form submission handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file with no content.",
  "frontend/src/components/CustomLists.tsx": "Displays custom user-created lists with their tasks, supporting drag-and-drop reordering, task management (edit, delete, toggle complete), and list deletion with confirmation. Includes buttons to add new tasks and lists.",
  "frontend/src/components/DayResetDialog.tsx": "Dialog for resetting daily routines with two options: 'Next Day Reset' (increments streaks for checked items, resets unchecked) and 'Skipped Day Reset' (unchecks all and resets all streaks to zero).",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task properties including title (20 char limit), description, list assignment, urgency/importance flags, long task status, and completion state. Adapts UI based on whether task is in a quadrant or custom list.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays the Eisenhower Matrix with four quadrants (Must Do, Should Do, Delegate/Could Do, May Do) for task prioritization. Supports drag-and-drop task management, expand/collapse functionality, and a button to switch to plan mode.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Main application header component displaying logo, date, authentication controls, theme toggle, admin dashboard access, and optional test date picker with day reset functionality.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog component that displays spending and earning insights with charts, showing data filtered by time period (daily/weekly/all-time) and balance status indicators.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file for monetary settings dialog component.",
  "frontend/src/components/MorningRoutine.tsx": "Component for managing morning/evening routine sections with drag-and-drop reordering, add/delete functionality, display mode toggle (single/two-column), and checkbox tracking for completed routines.",
  "frontend/src/components/OfflineIndicator.tsx": "Full-screen overlay component that detects and displays an offline message when the user loses internet connectivity.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog displaying payroll history records with edit and submit functionality, showing sorted entries with submission status and formatted dates.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Onboarding dialog that explains plan mode features, specifically how to drag tasks between lists and reorder them within lists.",
  "frontend/src/components/SettingsDialog.tsx": "Dialog component for configuring monetary settings including max daily earnings, routine allocations, and toggling the earnings system with validation and auto-distribution logic.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for managing spending records and presets with category selection, quick-add functionality, confirmation prompts, and CRUD operations for both spends and presets.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component with drag-and-drop support (desktop and touch), edit mode toggle via long-press, and task completion/deletion actions.",
  "frontend/src/components/TestDatePicker.tsx": "Test-only date picker dropdown displaying the last 31 days for routine system debugging, with distinctive orange styling to indicate non-production feature.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using next-themes with animated sun/moon icons.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog displaying daily earnings breakdown from morning/evening routines and daily priorities using quadrant-weight scaling, with payroll submission and history access.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing page for unauthenticated users showing app features, registered user count, login button, and admin bootstrap URL with copy functionality when admin token is present.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A dialog component for creating tasks with two modes: quadrant-based (urgent/important classification) and custom list selection, including support for long tasks and pre-selected lists.",
  "frontend/src/components/UserInfoDialog.tsx": "A dialog component for viewing and editing user profile information, specifically name (read-only) and email address with validation.",
  "frontend/src/components/UserProfileSetup.tsx": "An onboarding component that displays a full-screen card for new users to set up their profile with name and email validation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality and identity state management with AuthClient integration.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook managing per-user localStorage state for showing/hiding the plan mode tip, with migration support from legacy global storage key.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend API calls including tasks, lists, routines, user profiles, admin operations, payroll, spending, and tier management.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook providing date override functionality for testing routine system logic (daily rollover, streaks) without affecting tasks or payroll dates.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for theming (light/dark modes), utility classes for drag-drop, text selection, safe areas, and streak visualization animations.",
  "frontend/src/lib/types.ts": "Type definitions and conversion helpers for adding local React keys (localId) to backend Task and List types for stable component rendering.",
  "frontend/src/lib/userTier.ts": "Provides utility functions to convert UserTier enum values to display labels, retrieve all available tiers, and get tier ordering for the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with authorization checks, displaying tabs for user directory, tier settings, and storage monitoring. Shows unauthorized screen with bootstrap token instructions for non-admin users.",
  "frontend/src/pages/TaskManager.tsx": "Main task management page that orchestrates authentication, user profile setup, task/list operations, morning routines, earnings system, and various dialogs. Handles drag-and-drop, state management, and navigation between different views.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income using quadrant-based planned-weight threshold scaling with divisors (3, 2, or 1) based on planned weight thresholds (15, 30) for each quadrant.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop payloads to/from DataTransfer using custom and fallback MIME types for reliable task dragging across lists.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier limit error messages for tasks, routines, and custom lists, extracting limits and returning user-friendly error messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme properties, container queries, typography, and animation plugins.",
  "project_state.json": "Project state file for a routine tracking app with strike count system and two reset modes (Next Day Reset and Skipped Day Reset). Contains three pending fix requests to correct backend strike count update logic in reset functions while preserving frontend preview behavior."
}