{
  "backend/main.mo": "Motoko canister defining user, task, routine, payroll, and spending data models with access control and tier-based limits, plus supporting maps and type structures.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs associated with several admin dashboard–related features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of numerous frontend React components and utilities.",
  "frontend/docs/task-toggle-audit.md": "Technical audit explaining latency issues in task completion toggles and recommending optimistic updates similar to routines.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, light/dark mode themes, and base styles.",
  "frontend/index.html": "Root HTML document configuring PWA metadata, icons, and mounting the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and display settings.",
  "frontend/public/sw.js": "Service worker implementing install, activate, and fetch handlers for caching and offline support.",
  "frontend/src/App.tsx": "Main app component switching between Task Manager and Admin Dashboard views with theme and offline support.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty placeholder file for an admin dashboard dialog component.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "Admin interface listing users with search, pagination, tier changes, and admin promotion/demotion actions.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Simple loading screen shown during authentication bootstrap initialization.",
  "frontend/src/components/BottomNavigation.tsx": "Floating bottom nav handling plan mode toggling, long‑press detection, and quick‑access actions for tasks, lists, settings, earnings, and insights.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog for creating a new list with a name input and submission handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty placeholder file for a task‑creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Renders user-defined task lists with drag-and-drop, creation buttons, and list/task management actions.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s fields such as title, description, list assignment, and flags, with form handling.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays tasks in the four Eisenhower quadrants with drag-and-drop, expansion, and optional switch to plan mode.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright information and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top header with branding, date display, theme toggle, auth controls, and optional admin access.",
  "frontend/src/components/InsightsDialog.tsx": "Displays spend insights with charts, time‑period filtering, and balance status using tabs and recharts.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "File is empty or missing content.",
  "frontend/src/components/MorningRoutine.tsx": "Manages morning/evening routine lists with creation, deletion, completion toggling, and drag‑and‑drop reordering.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows a full‑screen overlay when the browser goes offline using online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Displays payroll history with edit and submit actions, supporting inline editing and status indicators.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Shows a tip dialog explaining how to drag tasks between lists in plan mode.",
  "frontend/src/components/SettingsDialog.tsx": "Provides UI for modifying monetary settings, toggling earnings, and adjusting daily category limits.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for adding spends and managing spend presets, including confirmation flows and CRUD handlers.",
  "frontend/src/components/TaskCard.tsx": "Task card with drag-and-drop and touch-based reordering logic, plus edit and completion controls.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button to toggle light and dark themes using next-themes.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog that calculates and displays daily income from tasks and routines, and submits payroll.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Login splash screen showing product features and an Internet Identity login button.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Dialog for creating tasks in quadrant or custom lists with form state and validation.",
  "frontend/src/components/UserInfoDialog.tsx": "Dialog for viewing and editing user profile email with validation and save handling.",
  "frontend/src/components/UserProfileSetup.tsx": "Form component for creating a user profile with name and email, using validation and a saveProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook managing whether to show a plan mode tip, with per-user localStorage tracking and migration from a legacy key.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin actions, app mode, and various backend interactions using the actor.",
  "frontend/src/index.css": "Tailwind base setup with theme variables, dark mode settings, and custom utility animations for streak effects.",
  "frontend/src/lib/types.ts": "Defines local React-friendly Task and List types with helpers to convert to and from backend types.",
  "frontend/src/lib/userTier.ts": "Maps user tiers to labels and provides a list of all tier values with labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that checks admin status and displays user management tools or an unauthorized screen.",
  "frontend/src/pages/TaskManager.tsx": "Main task manager page orchestrating authentication, queries, dialogs, routines, lists, and task operations.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Computes daily priorities income based on quadrant task weights and scaling rules.",
  "frontend/src/utils/dragPayload.ts": "Provides helpers to write and read drag-and-drop payloads using custom and fallback MIME types.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier‑limit errors and maps them to user‑friendly messages.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL parameters with sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Defines the project’s schema version, high-level app summary, and a list of existing features covering authentication, actor creation, token handling, RBAC, user profiles, and tier system details. Serves as a central registry of implemented functionality for planning and reference."
}