{
  "backend/main.mo": "Main backend actor defining all data types (User, Task, List, Routine, Spend, Payroll), user storage with Maps, tier-based limits, access control integration via MixinAuthorization, and constants for title length, admin count, and monetary settings.",
  "feature_evidence.json": "Feature evidence report documenting five admin dashboard features (page creation, storage visualization, per-user breakdown table, cycle balance display, and access control) with high confidence and mapped test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx (view state management), TaskManager.tsx (main page with bottom padding and mutation handlers), useQueries.ts (React Query hooks with storage monitoring), and UI components with drag-and-drop, theme toggle, and mobile optimizations.",
  "frontend/docs/task-toggle-audit.md": "Audit document analyzing task completion toggle latency caused by synchronous backend waits, blanket query invalidation, and lack of optimistic updates; recommends applying routine-style optimistic mutation pattern.",
  "frontend/docs/test-date-removal-plan.md": "Plan for removing temporary test date override feature used for debugging routine system logic, scoped only to routine-related operations and not affecting tasks, payroll, or spend tracking.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH color system defining light/dark mode CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS/Android app support, viewport-fit=cover for notched devices, manifest link, and apple-touch-icon references.",
  "frontend/public/manifest.json": "PWA manifest defining app name, theme colors, standalone display mode, portrait orientation, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with fallback to cache, cache versioning (momentum-v2), and offline support for navigation requests.",
  "frontend/src/App.tsx": "Root component managing view state between TaskManager and AdminDashboard, wrapped with ThemeProvider and including Toaster and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "Admin panel component for managing users with search, pagination, and actions to promote/demote admins and change user tiers. Displays user list in a table with principal IDs, names, and tier badges.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "Admin dashboard for monitoring canister storage metrics including memory usage, user breakdowns, and storage statistics. Shows progress bars, paginated user storage table, and formatted byte/cycle displays.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin interface for configuring tier limits (max tasks, custom lists, routines) for each user tier (basic, silver, gold, diamond). Supports unlimited values via toggle switches and persists changes to backend.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Full-screen loading component with centered spinner and gradient background displayed during authentication bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with mode switching (normal/plan), menu toggle, and action buttons for adding tasks/lists and accessing settings. Implements touch gestures including long-press detection and swipe-up to open menu.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating a new custom list with a name input field. Handles form submission and validation with loading states.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file placeholder for a task creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Displays custom user-created lists with their tasks, supporting drag-and-drop reordering, task management (edit/delete/complete), and list deletion with confirmation. Includes quick-add task buttons and empty state handling.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing existing tasks with fields for title (20 char limit), description, list assignment, and toggles for urgent/important/long-task/completed status. Adapts UI based on whether task is in quadrant or custom list.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays the Eisenhower Matrix with four quadrants (Must/Should/Delegate/May Do) for task prioritization. Supports drag-and-drop, task management, expandable/collapsible view, and includes a button to switch to plan mode.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, title, date display (responsive formatting), authentication controls via Internet Identity, theme toggle, optional test date picker, and admin dashboard access. Includes user profile dropdown with tier information.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog component displaying spending and earning insights with charts, time period filters (daily/weekly/all-time), and balance status indicators using Recharts for visualization.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "Component for managing morning/evening routine items with drag-and-drop reordering, add/delete functionality, display mode toggle (single/two-column), and long-press detection for reorder mode.",
  "frontend/src/components/OfflineIndicator.tsx": "Full-screen overlay component that detects and displays a message when the user loses internet connectivity using browser online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog displaying payroll history with sorted records, inline editing capability, submit functionality, and status indicators for submitted vs pending payrolls.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog explaining Plan Mode features, specifically how to drag tasks between lists and reorder them within lists.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring monetary system including max money per day, distribution across morning/evening routines and daily priorities, and toggling the earnings system with validation.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog component for managing spending records and presets with categories, amounts, and pre-deducted spend types. Includes confirmation dialogs, preset CRUD operations, and integrates with monetary settings.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component with drag-and-drop support for both desktop and mobile (touch events with long-press detection). Handles task editing, deletion, completion toggling, and visual drag feedback.",
  "frontend/src/components/TestDatePicker.tsx": "Test-only date picker component for routine debugging that displays the last 31 days in a dropdown. Features distinctive orange styling with a \"TEST\" label to clearly indicate non-production use.",
  "frontend/src/components/ThemeToggle.tsx": "Simple theme toggle button component that switches between light and dark modes using next-themes. Displays sun/moon icons with smooth rotation transitions.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog displaying daily earnings breakdown from completed tasks and routines (morning/evening) with quadrant-weighted calculations. Includes payroll submission functionality and history access.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing page for unauthenticated users showing app features, user count, and login button. Includes special admin bootstrap URL handling with copy-to-clipboard functionality.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Dual-mode task creation dialog with tabs for quadrant-based tasks (urgent/important matrix) and custom list tasks. Features automatic quadrant prediction and long-task flagging.",
  "frontend/src/components/UserInfoDialog.tsx": "Dialog component for viewing and editing user profile information (name and email). Includes email validation, save functionality, and toast notifications for success/error states.",
  "frontend/src/components/UserProfileSetup.tsx": "Initial user profile setup form displayed on first login. Collects user name and email with validation, creates a basic tier profile, and shows a welcome screen.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles actor initialization with identity, admin token setup, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePlanModeTip.ts": "Manages per-user localStorage state for showing/hiding a plan mode tip, with migration logic from legacy global storage to user-specific keys based on principal ID.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, tasks, lists, routines, payroll, spending, admin functions, and tier management with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook for overriding the current date in routine-related logic (completion checks, streaks, rollover) using sessionStorage, intended for temporary debugging and planned for removal.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, utility classes for drag-drop, text selection, safe areas, and GPU-accelerated streak visualization animations.",
  "frontend/src/lib/types.ts": "Defines local extended types (LocalTask, LocalList) with React-friendly localId fields and provides conversion helpers between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility functions for user tier management including label conversion, tier enumeration, and ordering for Basic/Silver/Gold/Diamond tiers.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for user directory, tier settings, and storage monitoring, including authorization checks and bootstrap token instructions for first-time setup.",
  "frontend/src/pages/TaskManager.tsx": "Main application page component that orchestrates authentication, user profile management, task/list CRUD operations, morning routines, earnings system, and multiple dialog modals (settings, insights, spend planning, etc.). Handles drag-and-drop task management across Eisenhower Matrix quadrants and custom lists.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income using quadrant-based planned-weight threshold scaling, where each quadrant (listId 1-4) applies divisors (3, 2, or 1) based on planned weight thresholds (<15, <30, >=30) to completed task weights.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop payloads (taskId, sourceListId) to/from DataTransfer using custom and fallback MIME types for cross-browser compatibility.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier limit errors (tasks, routines, custom lists) and returns user-friendly error messages with extracted limits.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and clearing sensitive parameters from the URL without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations using typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing Momentum productivity app architecture with single-canister Principal-based data isolation, current features including admin dashboard with storage monitoring, and pending feature requests for backend query functions to expose canister metrics."
}