{
  "backend/main.mo": "Motoko canister implementing the core backend actor with authorization, user profiles, tasks, lists, routines, payroll/earnings, and spending logic, defining all domain types and per-user state stored in maps.",
  "feature_evidence.json": "Placeholder feature evidence report JSON with no recorded features.",
  "frontend-file-summaries.txt": "Generated overview document summarizing frontend source files and their responsibilities for build and review purposes.",
  "frontend/docs/task-toggle-audit.md": "Technical audit explaining why task completion toggles are slow, identifying backend waits and full refetches, and recommending optimistic updates like routines.",
  "frontend/index.css": "Global Tailwind CSS base defining design tokens, OKLCH color variables, and full light/dark theme styling.",
  "frontend/index.html": "Application HTML entry point with PWA meta tags, icons, and root mount for the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, orientation, and installable icons.",
  "frontend/public/sw.js": "Service worker implementing basic network-first caching for core assets and offline fallback.",
  "frontend/src/App.tsx": "Root React component that sets up theme handling and renders TaskManager, toast notifications, and offline status.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Admin-only dialog showing a searchable, paginated user list with controls to promote or demote admins. Handles async actions, copy-to-clipboard for principals, and error states with toasts.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Full-screen loading indicator shown during authentication or bootstrap phases.",
  "frontend/src/components/BottomNavigation.tsx": "Mobile bottom navigation component handling plan mode switching, long-press gestures, animated menu actions, and access to task, list, and earnings features.",
  "frontend/src/components/CreateListDialog.tsx": "Modal dialog for creating a new custom list with controlled input, validation, and loading states.",
  "frontend/src/components/CreateTaskDialog.tsx": "Modal dialog component for creating new tasks, collecting task details and submitting them to the parent handler.",
  "frontend/src/components/CustomLists.tsx": "Renders and manages user-defined task lists with drag-and-drop, reordering, task CRUD actions, and optional plan mode UI. Handles list deletion confirmation and task sorting within lists.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog form for editing an existing task’s properties such as title, description, list, priority flags, and completion status. Syncs local state with the selected task and submits updates via a callback.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays tasks in an expandable Eisenhower Matrix with four quadrants, supporting drag-and-drop, reordering, and task actions. Includes visual quadrant styling and an optional switch to plan mode.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information and an external link with branding icons.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, user profile/admin access, theme toggling, and date display. Integrates Internet Identity login/logout and admin dashboard access.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog showing spending and balance insights with tabbed views and time-based filters, rendering charts via Recharts. Computes totals and balance status from spend records and monetary settings.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "File content not provided; likely defines a dialog for configuring or viewing monetary settings.",
  "frontend/src/components/MorningRoutine.tsx": "React component for managing morning/evening routines with add, delete, complete, reorder, display mode toggle, and expand/collapse functionality, including long-press drag reordering and confirmation dialogs.",
  "frontend/src/components/OfflineIndicator.tsx": "Global overlay component that listens to browser online/offline events and displays a full-screen offline warning when the user loses internet connectivity.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog component that displays payroll history, allows submitting pending payroll entries, and supports inline editing of past payroll totals with API mutations and toast feedback.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring monetary limits and earnings behavior, including sliders for budget allocation, enabling/disabling earnings, and validation with user prompts and toasts.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for tracking and planning spending with custom entries and presets, supporting quick adds, confirmations, preset CRUD, and spend deletion with category handling.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component supporting desktop and mobile drag-and-drop, long-press edit mode, completion toggling, editing, and deletion within task lists.",
  "frontend/src/components/ThemeToggle.tsx": "Icon button that toggles between light and dark themes using next-themes with animated sun/moon icons.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog component that calculates and displays today's earned income based on completed tasks and morning/evening routines using monetary settings, and submits payroll. It also integrates payroll history viewing and handles submission feedback with toasts.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing screen shown to unauthenticated users with product highlights and a login button. Triggers Internet Identity login and shows loading state during authentication.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Modal dialog for creating new tasks either in Eisenhower quadrants or custom lists, with form state, validation, and quadrant prediction logic. Supports pre-selected lists and resets state on open/close.",
  "frontend/src/components/UserProfileSetup.tsx": "Initial profile setup form that collects the user's name and creates a basic user profile with earnings enabled. Uses a mutation hook and displays success or error toasts.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on the current Internet Identity, falling back to an anonymous actor when unauthenticated. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication state, login/logout actions, and status flags. Wraps Dfinity AuthClient setup, identity persistence, and exposes identity to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines a large set of React Query hooks that wrap backend actor calls for user profiles, admin management, app mode, tasks, routines, and monetization, handling caching, mutations, and invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining design tokens, light/dark theme variables, base styles, and custom utility animations including drag states and streak visual effects.",
  "frontend/src/lib/types.ts": "Provides local React-friendly task and list types with stable localIds and helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Maps backend UserTier enum values to human-readable string labels with a safe default.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wires up React Query and Internet Identity providers.",
  "frontend/src/pages/TaskManager.tsx": "Main authenticated application page orchestrating task management, routines, settings, dialogs, and identity state using many custom hooks and UI components.",
  "frontend/src/utils/dragPayload.ts": "Utility for reliably serializing and deserializing drag-and-drop task payloads via DataTransfer with custom and fallback MIME types.",
  "frontend/src/utils/urlParams.ts": "Helper functions for reading, persisting, and clearing URL and hash-based parameters with sessionStorage fallbacks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, content scanning, custom color tokens via CSS variables, animations, and plugins.",
  "project_state.json": "Defines the current project schema, version, and a comprehensive high-level summary of the Momentum PWA along with a structured list of existing features (authentication, actor setup, RBAC, admin tools, productivity and monetization systems) used for planning and tracking build state."
}