{
  "backend/main.mo": "Main Motoko actor defining all data types (User, Task, List, MorningRoutine, PayrollRecord, SpendRecord, UserProfile, UserTier, MonetarySettings) and state maps for users, profiles, and access control with tier-based limits configuration.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: safe-area padding for Header component (REQ-1) and 50% height reduction for MorningRoutine containers (REQ-2).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, TaskManager, hooks, Header, EisenhowerMatrix, CustomLists, TaskCard, dialogs, and configuration files with implementation details.",
  "frontend/docs/task-toggle-audit.md": "Technical audit documenting task completion toggle latency issues caused by synchronous backend waits, blanket query invalidation, and lack of optimistic updates compared to instant routine toggles.",
  "frontend/docs/test-date-removal-plan.md": "Step-by-step plan for removing temporary test date override feature used for debugging routine system bugs, scoped only to routine-related logic.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark mode CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS/Android app support, viewport-fit=cover for safe areas, and manifest/icon references.",
  "frontend/public/manifest.json": "PWA manifest defining app name, theme colors, display mode (standalone), orientation (portrait-primary), and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with fallback to cache, cache versioning (momentum-v2), and offline support for navigation requests.",
  "frontend/src/App.tsx": "Root component managing view state to switch between TaskManager and AdminDashboard, wrapped with ThemeProvider and including Toaster and OfflineIndicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "Admin panel component for managing users with search, pagination, admin promotion/demotion, and user tier management functionality.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "Admin dashboard component displaying canister storage metrics, memory usage with progress bars, and paginated per-user storage breakdowns with copy-to-clipboard functionality.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin UI component for configuring tier limits (tasks, lists, routines) per user tier (basic, silver, gold, diamond) with support for unlimited values and save functionality.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Loading screen component displaying centered spinner with gradient background during authentication bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with mode switching (plan/normal), menu controls, and gesture handling including long-press detection and swipe-up for mode transitions.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating new custom lists with a name input field and form submission handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file placeholder for task creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Displays custom user-created lists with tasks, supporting drag-and-drop reordering, task management actions, and list deletion with confirmation for non-empty lists.",
  "frontend/src/components/DayResetDialog.tsx": "Dialog offering two routine reset options: next-day reset (increments streaks for completed, resets uncompleted) or skipped-day reset (resets all streaks to zero).",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task properties including title (20 char limit), description, list assignment, urgency/importance flags, long-task status, and completion state.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays Eisenhower Matrix with four quadrants (Must/Should/Delegate/May Do), supporting task drag-and-drop, expandable view, and plan mode switching.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Main application header component displaying logo, date, authentication controls, and admin/theme toggles. Handles Internet Identity login/logout and provides dropdown menu for user profile, admin dashboard access, and day reset functionality.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog component displaying spending and earning insights with charts using Recharts. Shows balance status, filtered spend data by time period (daily/weekly/all-time), and provides tabbed interface for spend, earning, and task analytics.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "Component for managing morning/evening routine sections with drag-and-drop reordering, add/delete functionality, and display mode toggling. Supports long-press for reorder mode, checkbox tracking, and expandable/collapsible sections with gradient styling.",
  "frontend/src/components/OfflineIndicator.tsx": "Full-screen overlay component that displays when the user goes offline, showing a disconnected icon and message. Listens to browser online/offline events and automatically hides when connection is restored.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog displaying payroll history records with edit and submit capabilities. Shows sorted list of payroll entries with status indicators, allows inline editing of totals, and handles payroll submission with balance updates.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog explaining Plan Mode features, specifically how to drag tasks between lists and reorder them. Provides a dismissible tip card with visual icons and encourages users to explore settings.",
  "frontend/src/components/SettingsDialog.tsx": "Dialog component for configuring monetary settings including max daily earnings, routine allocations, and toggling the earnings system on/off with validation.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for managing spending records and presets with category selection, confirmation prompts, and CRUD operations for both spends and reusable presets.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component with drag-and-drop support (desktop and touch), edit mode toggle, completion checkbox, and delete functionality.",
  "frontend/src/components/TestDatePicker.tsx": "Test-only date picker dropdown displaying the last 31 days for routine system debugging, with distinctive orange styling to indicate non-production feature.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with rotation animations.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog displaying daily earnings breakdown from morning/evening routines and daily priorities with quadrant-weight scaling, plus payroll submission functionality.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing page for unauthenticated users showing app features, registered user count, login button, and optional admin bootstrap URL with copy functionality.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Dialog component for creating tasks with two modes: quadrant-based (urgent/important) or custom list selection, with support for long tasks and pre-selected lists.",
  "frontend/src/components/UserInfoDialog.tsx": "Dialog for viewing and editing user profile information (name and email) with email validation and save functionality.",
  "frontend/src/components/UserProfileSetup.tsx": "Initial user profile setup card that collects name and email during first-time onboarding with validation and creates a basic tier user profile.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing it with the user's identity and admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing login/logout functionality, identity state management, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook managing per-user localStorage state for showing/hiding the plan mode tip, with migration support from legacy global storage key to user-specific keys.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, tasks, lists, routines, payroll, spending, admin functions, and tier management with proper cache invalidation.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook providing date override functionality for testing routine system logic (daily rollover, streaks) via sessionStorage, with clear removal plan documented.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for theming (light/dark modes), utility classes for drag-drop, text selection, safe areas, and streak visualization animations.",
  "frontend/src/lib/types.ts": "Type definitions extending backend Task and List types with local React keys (localId), plus helper functions for converting between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Provides utility functions to get user tier labels, retrieve all available tiers, and define tier ordering for the UserTier enum.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with authorization checks, displaying tabs for user directory, tier settings, and storage monitoring. Includes bootstrap token instructions for first-time admin setup.",
  "frontend/src/pages/TaskManager.tsx": "Main task manager page orchestrating authentication, user profile setup, task/list management, morning routines, earnings system, and various dialogs for settings, insights, and spending.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income using quadrant-based planned-weight threshold scaling with divisors (3, 2, or 1) based on weight thresholds (15, 30).",
  "frontend/src/utils/dragPayload.ts": "Provides utilities to write and read drag-and-drop payloads to/from DataTransfer using custom and fallback MIME types for cross-browser compatibility.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier limit errors (tasks, routines, custom lists) and returns user-friendly error messages with extracted limits.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, and existing features including safe-area padding for mobile notches and routine container height reduction."
}