{
  "backend/main.mo": "Motoko canister defining the core backend actor with access control, user profiles, tasks, lists, routines, earnings, spending, and payroll data models plus related constants and IDs.",
  "feature_evidence.json": "Machine-readable report linking specific frontend features to files, components, test IDs, and confidence levels for verification and audit purposes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend source files and components across the application.",
  "frontend/docs/task-toggle-audit.md": "Technical audit documenting why task completion toggles feel slow, identifying latency sources, and proposing optimistic updates as the fix.",
  "frontend/index.css": "Global Tailwind CSS styles defining design tokens, OKLCH color variables, and light/dark theme configuration for the app.",
  "frontend/index.html": "Main HTML entry point configuring meta tags, PWA support, and mounting the React app to the root element.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, colors, orientation, and standalone display behavior.",
  "frontend/public/sw.js": "Service worker implementing basic offline support with install, activate, and network-first fetch caching strategies.",
  "frontend/src/App.tsx": "Root React component that sets up theming, renders the TaskManager page, toast notifications, and an offline indicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Admin-only dialog for viewing, searching, and paginating users, with controls to promote or demote admin privileges. Integrates admin query hooks, copy-to-clipboard helpers, and error handling.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Fullscreen loading component with a spinner and message used during authentication or bootstrap flows.",
  "frontend/src/components/BottomNavigation.tsx": "Mobile-oriented bottom navigation bar handling plan mode switching, long-press gestures, animations, and entry points for tasks, lists, and settings.",
  "frontend/src/components/CreateListDialog.tsx": "Modal dialog with a form to create a new custom task list, managing local name state and submit/cancel actions with loading support.",
  "frontend/src/components/CreateTaskDialog.tsx": "File is empty or not yet implemented; intended to define a dialog for creating new tasks.",
  "frontend/src/components/CustomLists.tsx": "Renders and manages user-defined task lists with drag-and-drop, task actions, list creation/deletion, and optional plan mode behavior.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing an existing task’s fields, list assignment, and flags, syncing local state with the selected task and submitting updates.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays tasks in an expandable Eisenhower matrix with four quadrants, supporting drag-and-drop, reordering, plan mode switching, and task actions.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation header handling authentication, user/admin controls, theme toggle, date display, and admin dashboard access.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog showing spending and related insights with tabs, time-based filtering, balance status indicators, and bar chart visualizations.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "File is empty or not yet implemented; intended to manage or edit monetary settings via a dialog.",
  "frontend/src/components/MorningRoutine.tsx": "Renders a morning or evening routine list with add, delete, complete, expand, display mode toggle, and drag-and-drop reordering via long-press. Manages dialogs, confirmation alerts, and visual styling based on routine section.",
  "frontend/src/components/OfflineIndicator.tsx": "Listens to browser online/offline events and displays a full-screen overlay warning when the user is offline. Automatically hides itself when connectivity is restored.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Displays a scrollable dialog of payroll history with submission status, sorted by date. Allows editing and submitting payroll records with backend mutations and toast feedback.",
  "frontend/src/components/SettingsDialog.tsx": "Provides a settings dialog to configure monetary limits and enable or disable the earnings system. Handles interdependent sliders, validation, persistence, and user feedback via toasts.",
  "frontend/src/components/SpendPlanDialog.tsx": "Implements a dialog for logging spends, managing spend presets, and confirming transactions. Supports categories, preset CRUD operations, and backend integration with confirmation and error handling.",
  "frontend/src/components/TaskCard.tsx": "A memoized task card component supporting completion, edit, delete, and drag-and-drop reordering across lists. Includes advanced touch and long-press handling for mobile drag interactions.",
  "frontend/src/components/ThemeToggle.tsx": "A small icon button that toggles between light and dark themes using next-themes. Visually animates sun and moon icons based on the active theme.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog component that calculates and displays today's earnings based on completed tasks and morning/evening routines, using monetary settings. It allows submitting the calculated daily income to payroll and viewing payroll history.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing screen shown to unauthenticated users with app branding, feature highlights, and a button to log in via Internet Identity. Handles loading state during login.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "A modal dialog for creating new tasks either in Eisenhower quadrants or custom lists, with form state, validation, and quadrant prediction logic. Supports urgency, importance, long-task flags, and preselected lists.",
  "frontend/src/components/UserProfileSetup.tsx": "Onboarding card that prompts the user to enter their name and creates a basic user profile with earnings enabled. Uses a mutation hook and shows success or error toasts.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on the current Internet Identity, falling back to an anonymous actor when unauthenticated. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, identity persistence, and detailed login status flags. Wraps AuthClient creation and exposes an InternetIdentityProvider for the app.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks that wrap backend actor calls for user profiles, admin actions, app mode, tasks, routines, earnings, spending, and settings, handling caching and invalidation.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables for light/dark modes, and custom utility classes and animations for UI effects like streak visualizations.",
  "frontend/src/lib/backendTypes.ts": "Provides TypeScript type definitions and enums that mirror backend types not yet exported, plus re-exports available backend types for frontend use.",
  "frontend/src/lib/types.ts": "Defines local wrapper types for tasks and lists with stable React keys and helper functions to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Maps backend UserTier enum values to human-readable string labels for display.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the root App component.",
  "frontend/src/pages/TaskManager.tsx": "Main application page that orchestrates authentication, data hooks, state, and UI components for task management, routines, earnings, spending, and dialogs.",
  "frontend/src/utils/dragPayload.ts": "Utility functions to reliably write and read drag-and-drop payloads using DataTransfer with custom and fallback MIME types.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and safely clearing sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend sources, and extending the theme with CSS-variable-driven OKLCH colors, container settings, radii, shadows, and accordion animations. Includes typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the Momentum PWA, its current status, and a structured list of existing features with IDs, descriptions, and versions. Captures core auth, RBAC, user initialization, onboarding, and notes a current bootstrap regression blocking quadrant initialization."
}