{
  "backend/main.mo": "Defines the canister actor, user/task/list/routine/spending types, tier limits, and authorization mixin setup with initial state maps.",
  "feature_evidence.json": "Contains feature evidence records mapping feature IDs to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides high‑level summaries for many frontend files including components, hooks, dialogs, and styling.",
  "frontend/docs/task-toggle-audit.md": "Explains the latency issues in task completion toggles and compares them with routines’ optimistic update flow.",
  "frontend/index.css": "Defines global CSS variables for light/dark themes using OKLCH values and applies Tailwind base styles.",
  "frontend/index.html": "Main HTML entry point configuring PWA metadata, icons, and loading the React app.",
  "frontend/public/manifest.json": "PWA manifest describing app name, colors, icons, and standalone display settings.",
  "frontend/public/sw.js": "Service worker implementing cache installation, cleanup, and network‑first fetch handling with offline fallback.",
  "frontend/src/App.tsx": "Root React component wrapping TaskManager in ThemeProvider with toast and offline indicator components.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Admin dashboard dialog listing users with search, pagination, tier changes, and admin promotion/demotion.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Displays a centered loading spinner and message during auth bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation component handling plan mode toggles, long‑press detection, and action buttons with drag/gesture logic.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating a new list with a name input and submit handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "File is empty or contains no implemented component.",
  "frontend/src/components/CustomLists.tsx": "Renders and manages custom task lists with drag-and-drop, creation, deletion, and quick-add task actions.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing an existing task’s fields, list assignment, and properties with form handling.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays the Eisenhower quadrant task matrix with drag-and-drop, expand/collapse, and plan mode support.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with logo, date, theme toggle, authentication controls, and admin access.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog showing spending insights with charts, filters, and balance status indicators.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "File is empty or contains no implemented component.",
  "frontend/src/components/MorningRoutine.tsx": "Renders and manages a morning/evening routine list with add, delete, complete, drag‑and‑drop reorder, and display mode controls.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows a full‑screen offline message when the browser loses network connectivity.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Displays payroll history with editing and submission actions, including sorting, inline editing, and status indicators.",
  "frontend/src/components/PlanModeTipDialog.tsx": "A simple dialog presenting drag‑and‑drop tips for plan mode with a dismiss button.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for monetary limits, earnings toggling, and user profile editing with validation and sync to backend.",
  "frontend/src/components/SpendPlanDialog.tsx": "Spend planning dialog supporting spend creation, presets, confirmation prompts, and deletion of spend records.",
  "frontend/src/components/TaskCard.tsx": "Task card with drag-and-drop and touch long‑press handling, including edit mode, mobile DnD logic, and event callbacks.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button switching between light and dark modes using next-themes.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog that calculates daily earnings from tasks and routines and submits payroll.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Login landing screen with branding, feature highlights, and Internet Identity login button.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Task creation dialog supporting quadrant-based and custom list inputs with validation and tabbed UI.",
  "frontend/src/components/UserProfileSetup.tsx": "Form for creating a user profile with name, email validation, and backend save.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/usePlanModeTip.ts": "Tracks whether a user-specific plan mode tip has been shown using localStorage with legacy key migration.",
  "frontend/src/hooks/useQueries.ts": "Exports many React Query hooks that wrap actor calls for user profiles, admin actions, app mode, tasks, routines, and spending data.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables and custom utility animations for streak and visual effects.",
  "frontend/src/lib/types.ts": "Adds local IDs to Task/List types and provides helpers to convert between backend and local representations.",
  "frontend/src/lib/userTier.ts": "Utility helpers for converting UserTier enum values to labels and listing all available tiers.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/TaskManager.tsx": "Main UI container orchestrating identity, user profile, tasks, routines, spending features, dialogs, and local UI state.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Computes Daily Priorities income by scaling completed task weight per quadrant based on planned-weight thresholds and multiplying by a global unit.",
  "frontend/src/utils/dragPayload.ts": "Provides helpers to write and read stable drag payloads via DataTransfer using a custom MIME type with a text/plain fallback.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier-related errors and returns user-friendly messages for task, routine, list limits, and earnings restrictions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "JSON snapshot describing project schema, version, overall app summary, and a list of existing feature definitions."
}