{
  "backend/main.mo": "Motoko canister defining the core backend domain model and state for users, tasks, lists, routines, earnings, and spending, with access control mixed in. Implements IDs, data types, and user-specific maps to manage a full productivity and finance workflow.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no recorded features.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend source files, describing responsibilities, UI behavior, and recent architectural improvements.",
  "frontend/docs/task-toggle-audit.md": "Technical audit explaining why task completion toggles feel slow, identifying backend waits and full refetches as root causes. Recommends optimistic updates similar to routines to reduce perceived latency.",
  "frontend/index.css": "Global Tailwind CSS entry defining design tokens, light/dark themes, and base styles using OKLCH color variables.",
  "frontend/index.html": "HTML entry point configuring metadata, PWA support, icons, and mounting the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, display mode, and orientation.",
  "frontend/public/sw.js": "Service worker implementing basic offline support with network-first caching and cache version management.",
  "frontend/src/App.tsx": "Root React component that sets up theming, renders the main TaskManager page, toast notifications, and an offline indicator.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Admin-only dialog that lists users with search and pagination, showing roles and tiers. Allows promoting or demoting admins, copying principals, and handles related errors.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Fullscreen loading indicator shown during authentication or bootstrap phases.",
  "frontend/src/components/BottomNavigation.tsx": "Mobile-oriented bottom navigation with plan-mode switching, long-press interactions, animated menu controls, and entry points for tasks, lists, settings, and earnings features.",
  "frontend/src/components/CreateListDialog.tsx": "Modal dialog for creating a new custom list with controlled input, validation, and loading state handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Modal dialog component intended for creating new tasks, including form inputs and submission handling (implementation truncated in provided content).",
  "frontend/src/components/CustomLists.tsx": "Renders and manages user-defined task lists with drag-and-drop, touch reordering, task creation, and list deletion, supporting a plan mode and hidden state.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing a task’s title, description, list assignment, and flags, syncing local form state with the selected task and submitting updates.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays tasks in a four-quadrant Eisenhower matrix with expandable view, drag-and-drop reordering, plan mode support, and quadrant-specific styling.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright text, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, date display, theme toggle, user/admin menus, and admin dashboard access.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog showing spending insights with tabs, time filters, balance status, and bar charts derived from spend records and monetary settings.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Dialog component intended to configure or manage user monetary settings.",
  "frontend/src/components/MorningRoutine.tsx": "Renders and manages a morning/evening routine list with create, delete, complete, reorder (drag/long-press), and display mode toggling. Handles dialogs, confirmations, gradients, and section-specific behavior.",
  "frontend/src/components/OfflineIndicator.tsx": "Listens to browser online/offline events and displays a full-screen overlay warning when the user is offline.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog that displays payroll history, allows editing totals, and submitting payroll entries with status indicators and toasts.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring monetary limits and enabling/disabling the earnings system, with sliders, validation, and save/toggle actions.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog for adding, confirming, and deleting spending records, plus managing spend presets and categories with confirmation flows.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component supporting drag-and-drop (mouse and touch), long-press edit mode, completion toggling, editing, and deletion.",
  "frontend/src/components/ThemeToggle.tsx": "Button that toggles between light and dark themes using next-themes with animated sun/moon icons.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog component that calculates and displays today's earnings from completed tasks and routines using monetary settings, and submits the daily payroll. It memoizes income calculations and supports viewing payroll history and submission with success/error toasts.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing screen shown to unauthenticated users with app branding, feature highlights, and a login button. Triggers Internet Identity login and reflects loading state.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Dialog for creating new tasks either via Eisenhower quadrant logic or custom lists. Manages form state, predicts target quadrant based on urgency/importance, and submits task creation.",
  "frontend/src/components/UserProfileSetup.tsx": "Onboarding form that collects a user's name and creates their profile with default settings. Uses a backend mutation hook and shows success or error toasts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity. Recreates the actor on identity change and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication state. Handles login, logout, persisted identities, and exposes detailed login status flags to consumers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks that wrap backend actor calls for user profiles, admin management, app mode, tasks, routines, and monetization, handling caching, mutations, and invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, light/dark themes, base styles, and custom utility animations for drag states and streak visual effects.",
  "frontend/src/lib/types.ts": "Defines local React-friendly task and list types with stable local IDs and helper functions to convert to and from backend models.",
  "frontend/src/lib/userTier.ts": "Utility function that maps backend UserTier enum values to human-readable tier labels.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, Internet Identity context, and renders the root App component.",
  "frontend/src/pages/TaskManager.tsx": "Main task manager page orchestrating authentication, data hooks, UI state, and dialogs for tasks, routines, settings, spending, and insights.",
  "frontend/src/utils/dragPayload.ts": "Utility for reliably writing and reading task drag-and-drop payloads using custom and fallback MIME types on DataTransfer.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and hash-based parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, OKLCH-based color system, animations, dark mode, and plugins.",
  "project_state.json": "Defines the overall project snapshot for Momentum, a full-stack personal productivity PWA on the Internet Computer, including app summary, schema/versioning, and a catalog of implemented features. It enumerates existing frontend and backend capabilities such as authentication, actor creation, RBAC, user profiles, admin tools, and productivity/earnings systems for build and planning reference."
}