{
  "backend/main.mo": "Main backend actor defining user data structures (tasks, routines, lists, payroll, spending), tier-based limits, monetary settings, and access control integration with a maximum of 3 admins and 20-character title limit.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features for adding compact 4-row scrollable containers to Morning and Evening Routine sections in MorningRoutine.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including TaskManager, Header, EisenhowerMatrix, CustomLists, TaskCard, dialogs, and hooks with details on drag-and-drop, Plan Mode, character limits, and storage monitoring.",
  "frontend/docs/task-toggle-audit.md": "Audit documenting task completion toggle latency caused by synchronous backend waits and full query invalidation, recommending optimistic updates like those used for routines.",
  "frontend/docs/test-date-removal-plan.md": "Plan for removing temporary test date override feature used for debugging routine system logic, which only affects routine-related operations and not tasks, payroll, or spending.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH color system defining light/dark theme variables for background, foreground, primary, secondary, destructive, borders, charts, and sidebar colors.",
  "frontend/index.html": "HTML entry point with PWA meta tags, iOS/Android app support, theme color configuration, and manifest/icon links for standalone mobile app experience.",
  "frontend/public/manifest.json": "PWA manifest defining app name, theme colors, display mode (standalone), orientation (portrait), and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with fallback to cache, handling install/activate events, and cache versioning for offline support.",
  "frontend/src/App.tsx": "Root component managing view state between TaskManager and AdminDashboard, wrapped with ThemeProvider and including Toaster and OfflineIndicator components.",
  "frontend/src/components/admin/AdminDashboardDialog.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminUserDirectory.tsx": "Admin panel component for managing users with search, pagination, and actions to promote/demote admins and change user tiers. Displays user list in a table with principal IDs, names, admin status, and tier selection.",
  "frontend/src/components/admin/StorageMonitoring.tsx": "Admin dashboard for monitoring canister storage metrics including stable/heap memory usage, progress bars, and paginated per-user storage breakdowns. Shows overall storage against 4GB limit with color-coded warnings.",
  "frontend/src/components/admin/TierSettings.tsx": "Admin interface for configuring tier limits (maxTasks, maxCustomLists, maxRoutines) for each user tier (basic, silver, gold, diamond). Supports unlimited toggles and saves changes per tier with validation.",
  "frontend/src/components/AuthBootstrapLoading.tsx": "Loading screen component displaying centered spinner with gradient background shown during authentication bootstrap.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar component with mode switching (plan/normal), menu toggle, and action buttons for adding tasks/lists and accessing settings. Implements touch gestures including long-press detection and swipe-up to open menu.",
  "frontend/src/components/CreateListDialog.tsx": "Dialog component for creating a new custom list with a name input field and form submission handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Empty file placeholder for task creation dialog component.",
  "frontend/src/components/CustomLists.tsx": "Displays custom user-created lists with tasks, supporting drag-and-drop reordering, task management (edit/delete/complete), and list deletion with confirmation for non-empty lists.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog form for editing task properties including title (20 char limit), description, list assignment, urgency/importance flags, long-task status, and completion state.",
  "frontend/src/components/EisenhowerMatrix.tsx": "Displays the four-quadrant Eisenhower Matrix (Must/Should/Delegate/May Do) with expandable view, drag-and-drop task management, and color-coded quadrants based on urgency and importance.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, date display (responsive formatting), authentication controls via Internet Identity, theme toggle, admin dashboard access, and optional test date picker for development.",
  "frontend/src/components/InsightsDialog.tsx": "Dialog component displaying spending and earning insights with charts, tabs for different views (spend/earning/task), time period filters (daily/weekly/all-time), and balance status indicators using Recharts for visualization.",
  "frontend/src/components/MonetarySettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/MorningRoutine.tsx": "Component for managing morning/evening routine items with drag-and-drop reordering, add/delete functionality, display mode toggle (single/two-column), expandable sections, and checkbox tracking for completed routines.",
  "frontend/src/components/OfflineIndicator.tsx": "Full-screen overlay component that detects and displays a message when the user loses internet connectivity, listening to browser online/offline events.",
  "frontend/src/components/PayrollHistoryDialog.tsx": "Dialog displaying payroll history records with inline editing capabilities, submission status tracking, and formatted date/amount display sorted by date.",
  "frontend/src/components/PlanModeTipDialog.tsx": "Informational dialog showing tips for using Plan Mode, specifically explaining drag-and-drop functionality for organizing tasks between lists.",
  "frontend/src/components/SettingsDialog.tsx": "Settings dialog for configuring monetary system parameters including max money per day, earnings distribution across morning/evening routines and daily priorities, with earnings system toggle and automatic value distribution logic.",
  "frontend/src/components/SpendPlanDialog.tsx": "Dialog component for managing spending records and presets with categories, amounts, and confirmation flows. Supports creating, editing, and deleting both individual spends and reusable presets.",
  "frontend/src/components/TaskCard.tsx": "Memoized task card component with drag-and-drop support for both desktop and mobile (touch events). Includes edit mode, completion toggle, and long-press detection for mobile interactions.",
  "frontend/src/components/TestDatePicker.tsx": "Test-only date picker component for routine debugging that displays the last 31 days with distinctive orange styling. Allows switching between real date and historical dates for testing purposes.",
  "frontend/src/components/ThemeToggle.tsx": "Simple theme toggle button component that switches between light and dark modes using next-themes. Displays sun/moon icons with smooth transitions.",
  "frontend/src/components/TodayEarnsDialog.tsx": "Dialog displaying daily earnings breakdown from tasks and routines (morning/evening) with weighted calculations. Includes payroll submission functionality and access to payroll history.",
  "frontend/src/components/UnauthenticatedScreen.tsx": "Landing page for unauthenticated users showing app features and login button. Displays registered user count and handles admin bootstrap URL with copy functionality.",
  "frontend/src/components/UniversalAddTaskDialog.tsx": "Dual-mode task creation dialog with tabs for quadrant-based tasks (urgent/important matrix) and custom list tasks. Includes task properties like long-task flag and auto-predicts quadrant placement.",
  "frontend/src/components/UserInfoDialog.tsx": "Dialog component for viewing and editing user profile information (name and email). Includes email validation, edit state management, and toast notifications for save operations.",
  "frontend/src/components/UserProfileSetup.tsx": "Initial user profile setup form displayed to new users. Collects name and email with validation, creates a basic tier profile, and shows a welcome screen with gradient styling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles actor initialization with identity, admin token setup, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, providing login/logout functionality, identity management, and auth state tracking with support for delegation identity and local storage persistence.",
  "frontend/src/hooks/usePlanModeTip.ts": "Hook managing per-user localStorage state for showing/hiding a plan mode tip, with migration logic from legacy global storage to user-specific keys based on principal ID.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend API calls including user profiles, tasks, lists, routines, payroll, spending, admin operations, and tier management with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useTestDate.ts": "Test-only hook providing date override functionality for testing routine system logic (daily rollover, streaks) without affecting tasks, payroll, or spend tracking; persists to sessionStorage.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, utility classes for drag-and-drop, text selection control, safe areas, and GPU-accelerated streak visualization animations.",
  "frontend/src/lib/types.ts": "Type definitions and conversion utilities for adding local React keys to backend Task and List types, enabling stable component rendering without mutating backend data.",
  "frontend/src/lib/userTier.ts": "Utility functions for user tier management including label conversion, tier enumeration, and ordering for Basic/Silver/Gold/Diamond tiers.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for user directory, tier settings, and storage monitoring; includes authorization checks and bootstrap token instructions for first-time admin setup.",
  "frontend/src/pages/TaskManager.tsx": "Main application page component that orchestrates task management, morning/evening routines, earnings system, and user authentication. Manages multiple dialog states and integrates all major features including Eisenhower Matrix, custom lists, settings, and user profile setup.",
  "frontend/src/utils/dailyPrioritiesEarnings.ts": "Calculates daily priorities income using quadrant-based planned-weight threshold scaling with divisors (3, 2, or 1) based on planned weight thresholds (<15, <30, >=30). Processes tasks from quadrants 1-4 and multiplies scaled completed weight by a unit derived from total planned weight.",
  "frontend/src/utils/dragPayload.ts": "Provides utilities for writing and reading drag-and-drop payloads to/from DataTransfer with multiple MIME types for compatibility. Ensures reliable drop operations by persisting task and list IDs during drag events.",
  "frontend/src/utils/tierErrors.ts": "Parses backend tier limit errors for tasks, routines, and custom lists, extracting numeric limits and formatting user-friendly error messages. Provides generic fallback for unrecognized errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to store, retrieve, clear, and remove parameters from URLs without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file documenting known issues with streak count functionality, existing features for compact routine containers, and pending feature requests including renaming 'Reset New day' button to 'Start New Day'."
}