{
  "kind": "build_request",
  "title": "Convert Admin Dashboard from modal dialog to a dedicated full page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Replace the current modal-based Admin Dashboard UI with a dedicated, full-screen Admin Dashboard page (not a popup/modal), preserving existing functionality (user list display, search, pagination, promote/demote admin, and tier updates).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Yes fix it",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Admin entry point opens a full-page Admin Dashboard view (no Dialog/modal overlay behavior).",
        "The Admin Dashboard page supports normal document/page scrolling and does not trap focus like a modal.",
        "The Admin Dashboard page retains search, pagination, principal copy, role actions, and tier selection behavior currently present in AdminDashboardDialog."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add in-app navigation to access the Admin Dashboard as a standalone page view (e.g., via a simple route-like mechanism or internal view state) and provide an obvious way to return to the main Task Manager screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Yes fix it",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "From the main UI, an admin user can open the Admin Dashboard page from the header.",
        "The Admin Dashboard page includes a clear 'Back' control that returns the user to the prior/main screen.",
        "Returning from the Admin Dashboard page restores the main UI without requiring a full refresh."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure the Admin Dashboard page is access-controlled in the UI: if the caller is not an admin, do not show the user directory; instead show an English-language unauthorized message and a way to navigate back.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "When the user list is empty, it almost always means one of these:",
          "Yes fix it",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "If the current user is not an admin, the Admin Dashboard page shows an 'Unauthorized' style message (English) and does not render the user list table.",
        "If the current user is an admin, the user list table renders and actions work as before.",
        "No scenario results in a misleading empty list for non-admins without any explanation."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Eliminate render-time side effects in the admin user list pagination logic by removing the state-setting useMemo pattern and using an appropriate effect-based approach so page clamping does not occur during render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Yes fix it",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "The current-page clamping logic no longer sets React state during render.",
        "Pagination remains stable when filtering changes total pages (e.g., searching reduces results and current page is adjusted safely)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/immutablePaths (notably: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui).",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services.",
    "Use English for all user-facing text introduced or modified by this change."
  ],
  "nonGoals": [
    "Do not redesign or change backend RBAC/admin assignment behavior.",
    "Do not add third-party authentication or any new auth provider beyond Internet Identity.",
    "Do not change tier limits or tier enforcement rules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}