{
  "kind": "build_request",
  "title": "Compact routine containers with scrolling and rename button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Modify the Morning Routine container in MorningRoutine.tsx to have a compact height that displays a maximum of 4 rows of routine items. When more than 4 rows exist, the container should become vertically scrollable while maintaining the compact height limit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "make Morning Routine and Evening Routine container height more compact for maximum 4 rows of routines, after that it will be scrollable"
        ]
      },
      "acceptanceCriteria": [
        "Morning Routine container displays maximum 4 rows of routine items at any given time",
        "When routine items exceed 4 rows, vertical scrollbar appears",
        "Container height remains compact and does not expand beyond the 4-row limit",
        "Scrolling is smooth and maintains routine item interaction capabilities"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Modify the Evening Routine container in MorningRoutine.tsx to have a compact height that displays a maximum of 4 rows of routine items. When more than 4 rows exist, the container should become vertically scrollable while maintaining the compact height limit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "make Morning Routine and Evening Routine container height more compact for maximum 4 rows of routines, after that it will be scrollable"
        ]
      },
      "acceptanceCriteria": [
        "Evening Routine container displays maximum 4 rows of routine items at any given time",
        "When routine items exceed 4 rows, vertical scrollbar appears",
        "Container height remains compact and does not expand beyond the 4-row limit",
        "Scrolling is smooth and maintains routine item interaction capabilities"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Change the button label from 'Reset New day' to 'Start New Day' in the component where the new day reset functionality is implemented (likely in TaskManager.tsx or related routine management component).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Change Reset New day button name to \"Start New Day\" button"
        ]
      },
      "acceptanceCriteria": [
        "Button displays 'Start New Day' as its label text",
        "Button functionality remains unchanged",
        "Button styling and placement remain consistent with current design"
      ]
    }
  ],
  "constraints": [
    "Do not modify the routine functionality or drag-and-drop behavior",
    "Maintain existing routine item height and spacing within the scrollable containers",
    "Preserve all existing MorningRoutine.tsx features including display mode toggle and reorder functionality"
  ],
  "nonGoals": [
    "Changing the routine item card design or layout",
    "Modifying backend routine logic or data structures",
    "Altering routine completion or streak count functionality",
    "Implementing new routine features beyond the specified UI changes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}