{
  "kind": "build_request",
  "title": "Seed default onboarding custom lists “Week” and “Month” for every new user (non-admin-gated)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Update the backend new-user creation lifecycle so that, when a Principal is seen for the first time (i.e., the user record does not yet exist), the canister automatically creates two empty, normal custom lists owned by that user named exactly “Week” and “Month” (non-quadrant: quadrant=false, urgent=false, important=false). This must run for all authenticated users (not admin-only) and must be part of the one-time user creation path (not invoked on subsequent app loads).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "build it, ensure it will apply for all users not only admins"
        ]
      },
      "acceptanceCriteria": [
        "When a brand-new authenticated user first triggers backend user creation, getAllLists() returns the 4 quadrant lists plus two additional lists named exactly “Week” and “Month”.",
        "“Week” and “Month” are created with quadrant=false, urgent=false, important=false and contain no tasks at creation time.",
        "The onboarding list creation runs for any authenticated user regardless of admin status/role."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Ensure the backend never auto-recreates “Week” and/or “Month” for an existing user after initial creation. Specifically: if the user later deletes or renames either list, subsequent logins, quadrant bootstrap calls, or list fetches must not recreate them automatically.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "show it will never need to check the flag again?"
        ]
      },
      "acceptanceCriteria": [
        "If an existing user deletes the “Week” list, then calls getAllLists() again, the “Week” list does not reappear unless the user manually creates a new list named “Week”.",
        "If an existing user renames “Month” to another name, then calls getAllLists() again, there is no newly-created list named “Month”.",
        "Quadrant initialization (ensureAllQuadrants / implicit quadrant ensure during getOrCreate) does not create or restore “Week”/“Month”."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic implemented in backend/main.mo.",
    "Do not introduce admin-only gating for onboarding list creation; it must apply to all authenticated users uniformly.",
    "Do not add recurring per-login/per-fetch checks or ‘repair’ logic that recreates deleted onboarding lists."
  ],
  "nonGoals": [
    "Do not seed Morning Routine instructional items in this step.",
    "Do not change the existing quadrant list initialization behavior (IDs 1–4) beyond keeping it independent from onboarding list seeding.",
    "Do not create any tasks inside “Week” or “Month”.",
    "Do not add new UI screens specifically for onboarding; the lists should appear naturally wherever custom lists are rendered."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}