{
  "kind": "build_request",
  "title": "Add Momentum logo asset and display in global header + login page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the uploaded Momentum logo image (Momentum.png) to the frontend as a static asset so it loads instantly without any backend fetch, and ensure it can be referenced via a stable path in the UI (e.g., under frontend/public/assets/...).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "help me update new logo name \"Momentum\"\nstore it somewhere so it can retrieved quickly"
        ]
      },
      "acceptanceCriteria": [
        "The Momentum logo is stored as a frontend static file under frontend/public (or a subfolder such as frontend/public/assets/...)",
        "The logo is served by the frontend at a stable URL path and does not require any backend call to load"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the global app header (frontend/src/components/Header.tsx) to display the Momentum logo using the new static asset, and ensure the logo renders cleanly (no stretching/cropping) across common screen sizes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-2"
        ],
        "quotes": [
          "Make the logo headers",
          "2. global header"
        ]
      },
      "acceptanceCriteria": [
        "The global header shows the Momentum logo on all authenticated screens where the header is used",
        "The logo uses object-fit styling (or equivalent) so it does not appear distorted",
        "The logo path in Header.tsx points to the new stored Momentum logo asset (not a placeholder/old filename)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the unauthenticated/login page (frontend/src/components/UnauthenticatedScreen.tsx) to display the Momentum logo at full uploaded resolution (or the maximum practical size without distortion), centered, and styled so it looks visually balanced with the rest of the card layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-3"
        ],
        "quotes": [
          "put logo in login page",
          "3 fully uploaded resolution make sure it look nice"
        ]
      },
      "acceptanceCriteria": [
        "The login/unauthenticated screen displays the Momentum logo above the login button",
        "The logo is displayed without distortion and at a large, high-quality size (not forced into a small fixed square like an icon)",
        "The layout remains responsive on mobile and desktop (logo does not overflow the card or cause horizontal scrolling)"
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui"
  ],
  "nonGoals": [
    "Do not add backend storage or APIs for retrieving the logo",
    "Do not change authentication behavior (Internet Identity) beyond adding branding"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}