{
  "kind": "build_request",
  "title": "Persist Plan Mode onboarding tip per user (not per device)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Update the Plan Mode tip persistence logic so the “Plan Mode Tips” instruction dialog is tracked per authenticated user (keyed by the user’s Internet Identity principal) rather than a single shared localStorage key for the whole browser/device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Why cannot see the 4 instructions on new users after registration",
          "Those onboarding steps are being tracked in localStorage, which is shared by all users on the same device.",
          "If you want, I can adjust the code so onboarding is stored per user instead of per device.",
          "Yes please",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "When User A logs in on a device, enters Plan Mode, and dismisses the Plan Mode tip, User A does not see it again on that device after reload/restart.",
        "After User A logs out, User B logs in on the same device and enters Plan Mode, User B does see the Plan Mode tip (even though User A previously dismissed it).",
        "The tip dialog content remains unchanged (including the exact text: \"The Real Magic Is in Settings.\")."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a client-side migration/fallback so existing users who previously dismissed the Plan Mode tip under the old shared localStorage key keep it dismissed for their own account after upgrading (without affecting other users on the same device).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Those onboarding steps are being tracked in localStorage, which is shared by all users on the same device."
        ]
      },
      "acceptanceCriteria": [
        "If the old shared localStorage key indicates the tip was previously dismissed, the currently logged-in user is treated as dismissed under the new per-user key after the update.",
        "The migration does not cause the tip to be dismissed for other users who log in later on the same device."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI sources are read-only).",
    "Do not modify any files listed in SYSTEM_CONTEXT.frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding new onboarding/tutorial steps or changing the number of instruction steps.",
    "Moving onboarding-tip persistence into the backend canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}