{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Plan mode X button hides My Lists and reveals routines without switching mode",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "In Plan mode, change the X button to only toggle section visibility (hide CustomLists and show Morning/Evening routines) without changing the persisted app mode, eliminating flicker from mode switching.",
      "acceptanceCriteria": [
        "In Plan mode, tapping the X button does not change the underlying app mode value (Plan mode remains active).",
        "After tapping X in Plan mode, the “My Lists” UI is not visible.",
        "After tapping X in Plan mode, both “Morning Routine” and “Evening Routine” UIs are visible.",
        "Pressing the X button no longer causes visible flicker/jitter from rapid section unmount/mount during the transition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BottomNavigation.tsx",
          "operation": "modify",
          "description": "Replace the Plan-mode X button behavior so it no longer calls onSwitchMode(0). Add a dedicated Plan-mode X callback prop (e.g., onPlanModeX) and invoke it when isPlanMode is true, ensuring no app mode mutation occurs from the X button. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TaskManager.tsx",
          "operation": "modify",
          "description": "Introduce Plan-mode-only UI state to control which Plan subview is shown (e.g., 'lists' vs 'routines'). Default to showing CustomLists when entering Plan mode, and when the Plan-mode X callback fires: keep appMode unchanged, set CustomLists to hidden (via its existing isHidden prop) and render/unhide both MorningRoutine sections while still in Plan mode. Wire the new BottomNavigation Plan-mode X callback to this state transition. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}