{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Compact routine containers with scrolling and rename button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Morning Routine container compact with 4-row height limit and vertical scrolling",
      "acceptanceCriteria": [
        "Morning Routine container displays maximum 4 rows of routine items at any given time",
        "When routine items exceed 4 rows, vertical scrollbar appears",
        "Container height remains compact and does not expand beyond the 4-row limit",
        "Scrolling is smooth and maintains routine item interaction capabilities"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Modify the Morning Routine section container to apply a max-height constraint that limits display to approximately 4 rows of routine items. Add overflow-y-auto class to enable vertical scrolling when content exceeds the height limit. Calculate the max-height based on typical routine item height (including padding and gaps) multiplied by 4. Ensure the scrollable container maintains drag-and-drop functionality and touch interactions for routine item reordering."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make Evening Routine container compact with 4-row height limit and vertical scrolling",
      "acceptanceCriteria": [
        "Evening Routine container displays maximum 4 rows of routine items at any given time",
        "When routine items exceed 4 rows, vertical scrollbar appears",
        "Container height remains compact and does not expand beyond the 4-row limit",
        "Scrolling is smooth and maintains routine item interaction capabilities"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Modify the Evening Routine section container to apply a max-height constraint that limits display to approximately 4 rows of routine items. Add overflow-y-auto class to enable vertical scrolling when content exceeds the height limit. Calculate the max-height based on typical routine item height (including padding and gaps) multiplied by 4. Ensure the scrollable container maintains drag-and-drop functionality and touch interactions for routine item reordering."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Change 'Reset New day' button label to 'Start New Day'",
      "acceptanceCriteria": [
        "Button displays 'Start New Day' as its label text",
        "Button functionality remains unchanged",
        "Button styling and placement remain consistent with current design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TaskManager.tsx",
          "operation": "modify",
          "description": "Locate the button with text 'Reset New day' in the TaskManager component and change its label text to 'Start New Day'. Preserve all existing button functionality, onClick handlers, disabled states, styling classes, and positioning within the component."
        }
      ]
    }
  ]
}