{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix strike count update logic for routine reset buttons",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Preserve the existing frontend preview behavior where checking a routine shows strike count + 1 in the badge and unchecking shows the current strike count, with no backend calls during check/uncheck actions",
      "acceptanceCriteria": [
        "Checking a routine displays strike count + 1 in the badge as a preview",
        "Unchecking a routine displays the current strike count in the badge",
        "No backend calls are made during check/uncheck actions",
        "Preview behavior updates instantly without waiting for backend responses"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Review and verify that the existing checkbox toggle logic in the MorningRoutine component correctly displays strike count + 1 when checked (preview) and the current strike count when unchecked, without making backend calls. Ensure the local state management for checkbox tracking (completedRoutines state) works correctly with the preview display logic. If the preview calculation is not working as expected, adjust the badge display logic to show routine.strikeCount + 1 for checked routines and routine.strikeCount for unchecked routines, using the local completedRoutines state to determine checked status."
        },
        {
          "path": "frontend/src/components/DayResetDialog.tsx",
          "operation": "modify",
          "description": "Verify that the dialog correctly passes the current checked state to the backend reset functions (resetNewDay and resetSkippedDay) without modifying the preview behavior. Ensure that after successful reset operations, the local completedRoutines state is cleared to reflect all unchecked boxes. Add error handling to display user-friendly messages if the reset operations fail. The dialog should not alter how checkboxes preview strike counts - that logic remains in MorningRoutine.tsx."
        }
      ]
    }
  ]
}