{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add safe-area padding and compact routine containers",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add safe-area padding to Header component for iOS Dynamic Island and Android notches/punch-holes",
      "acceptanceCriteria": [
        "Header has top padding that respects device safe-area-inset-top",
        "Header content is not obscured by iOS Dynamic Island or Android notches/punch-holes",
        "Safe-area padding is applied using CSS environment variables"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add CSS env(safe-area-inset-top) padding to the header container element to accommodate iOS Dynamic Island and Android notches/punch-holes. Apply the padding using inline style or className that references the CSS environment variable, ensuring header content (logo, date, auth controls, theme toggle) is not obscured by device cutouts."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reduce Morning and Evening routine container heights by 50% in MorningRoutine component",
      "acceptanceCriteria": [
        "Morning routine container height is reduced by 50%",
        "Evening routine container height is reduced by 50%",
        "All routine functionality (drag-and-drop, checkboxes, add/delete) remains intact",
        "Routine items remain readable and interactive after height reduction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Reduce the height of the Morning and Evening routine container elements by 50% to make them more compact. Modify the height-related CSS classes or inline styles for both routine section containers while preserving all existing functionality including drag-and-drop reordering, checkbox interactions, add/delete operations, and two-column display mode. Ensure routine items remain readable and interactive after the height reduction."
        }
      ]
    }
  ]
}