{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Manual Daily Reset System for Routines",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a 'Reset New Day' button in the app header component (Header.tsx) positioned next to the dark mode toggle button",
      "acceptanceCriteria": [
        "Button appears in the header next to the theme toggle",
        "Button is visible and accessible on both mobile and desktop views",
        "Button has appropriate styling consistent with the header design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a 'Reset New Day' button next to the dark mode toggle. The button should be styled consistently with existing header buttons and positioned in the header controls area. Include responsive styling for mobile and desktop views. Wire the button to trigger the manual reset workflow when clicked."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Modify MorningRoutine.tsx to implement frontend-only check/uncheck interaction with instant visual feedback without triggering backend saves on individual check/uncheck actions",
      "acceptanceCriteria": [
        "Clicking routine checkboxes updates UI immediately",
        "No backend mutation calls are triggered on check/uncheck",
        "Routine checked state is maintained in local component state only"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Remove the backend mutation call from the checkbox toggle handler. Instead, maintain checked state in local React state (using useState or useReducer to track which routine IDs are checked). Update the checkbox UI to reflect this local state immediately when clicked. Ensure the completeMorningRoutine mutation is no longer called on individual check/uncheck actions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the strike count badge display logic in MorningRoutine.tsx to show strike count + 1 when a routine is checked (preview of tomorrow's count) and the current strike count when unchecked",
      "acceptanceCriteria": [
        "Badge shows current strike count for unchecked routines",
        "Badge shows strike count + 1 for checked routines",
        "Badge updates instantly when checking/unchecking routines"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Update the streak count badge display logic to compute the display value based on local checked state. When a routine is checked in local state, display routine.streakCount + 1. When unchecked, display routine.streakCount. Ensure this computation happens reactively whenever local checked state changes so the badge updates instantly."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement the manual reset workflow triggered by clicking the 'Reset New Day' button: save all currently checked routines to the backend (incrementing their strike counts by 1), reset all unchecked routines' strike counts to 0 in the backend, and clear all routine checkboxes back to unchecked state in the frontend",
      "acceptanceCriteria": [
        "Clicking 'Reset New Day' calls a backend function with the list of checked routine IDs",
        "Backend increments strike count by 1 for all checked routines",
        "Backend resets strike count to 0 for all unchecked routines",
        "Frontend clears all checkboxes to unchecked state after successful backend save",
        "User receives confirmation feedback when reset completes successfully",
        "Routine queries are invalidated to reflect updated strike counts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Wire the 'Reset New Day' button to trigger the manual reset mutation hook from useQueries.ts. Pass the array of checked routine IDs from MorningRoutine component state to the mutation. Show loading state on the button while the mutation is in progress. Display a toast notification on success or error. Coordinate with MorningRoutine.tsx to access the checked routine IDs state (consider lifting state or using a callback pattern)."
        },
        {
          "path": "frontend/src/components/MorningRoutine.tsx",
          "operation": "modify",
          "description": "Expose the local checked routine IDs state to the parent component (TaskManager or Header) via a callback or ref so the 'Reset New Day' button can access it. After the manual reset mutation succeeds, clear the local checked state back to an empty set/array so all checkboxes return to unchecked. Ensure this happens in response to the mutation success callback."
        },
        {
          "path": "frontend/src/pages/TaskManager.tsx",
          "operation": "modify",
          "description": "If MorningRoutine state needs to be lifted or coordinated with Header, manage the checked routine IDs state at this level and pass it down as props. Coordinate the manual reset flow between Header (which has the button) and MorningRoutine (which maintains the checked state). Ensure proper state clearing after successful reset."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Create a React Query mutation hook in useQueries.ts for the manual daily reset operation that calls the new backend function with checked routine IDs",
      "acceptanceCriteria": [
        "Mutation hook accepts array of checked routine IDs as parameter",
        "Hook triggers backend reset function when called",
        "Hook invalidates routine queries on success",
        "Hook provides loading, error, and success states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useManualResetRoutines that accepts an array of RoutineId values as the mutation parameter. Call actor.manualResetRoutines(completedRoutineIds) in the mutation function. On success, invalidate all routine-related queries (getAllMorningRoutines, getMorningRoutinesBySection) to fetch updated streak counts. Return standard mutation states (isLoading, isError, isSuccess, mutate, mutateAsync) for UI integration."
        }
      ]
    }
  ]
}