{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-user persistence and migration for Plan Mode tip dialog",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Persist Plan Mode tip dismissal per authenticated user (keyed by Internet Identity principal) instead of a shared device-wide localStorage key.",
      "acceptanceCriteria": [
        "When User A logs in on a device, enters Plan Mode, and dismisses the Plan Mode tip, User A does not see it again on that device after reload/restart.",
        "After User A logs out, User B logs in on the same device and enters Plan Mode, User B does see the Plan Mode tip (even though User A previously dismissed it).",
        "The tip dialog content remains unchanged (including the exact text: \"The Real Magic Is in Settings.\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePlanModeTip.ts",
          "operation": "modify",
          "description": "Update the hook to store and read the Plan Mode tip dismissal using a per-user localStorage key derived from the authenticated user's Internet Identity principal (e.g., a principal-suffixed key), and to re-check whenever the principal changes. Use the authorization component's authentication model by basing the key on the current Internet Identity principal; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TaskManager.tsx",
          "operation": "modify",
          "description": "Pass the authenticated user's Internet Identity principal string (from the existing useInternetIdentity identity) into usePlanModeTip so the tip display logic is evaluated per logged-in user session. Use the authorization component's identity access pattern (useInternetIdentity) to obtain the principal; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Migrate the old shared Plan Mode tip dismissal flag to the new per-user key for the currently logged-in user only.",
      "acceptanceCriteria": [
        "If the old shared localStorage key indicates the tip was previously dismissed, the currently logged-in user is treated as dismissed under the new per-user key after the update.",
        "The migration does not cause the tip to be dismissed for other users who log in later on the same device."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePlanModeTip.ts",
          "operation": "modify",
          "description": "Add a client-side fallback/migration: when a principal-scoped key is not yet present for the current user, check the legacy shared localStorage key and, if it indicates dismissal, write the dismissal state into the current user's per-user key and clear the legacy shared key so it cannot affect later logins by other users on the same device. Use the authorization component's authentication model by ensuring migration only runs when a non-anonymous principal is available; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}