{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Momentum is a mobile-first personal productivity PWA on the Internet Computer with Internet Identity auth. UX centers on Daily Priorities (Eisenhower 2×2) plus Plan mode (My Lists), daily Morning/Evening routines with streaks, drag-and-drop/reorder, and an optional earnings/spend system (Cash Flow settings, Today Earns/Submit Payroll, Spend Plan, Insights). Recent work also adds an Admin Dashboard (moving toward a full page), user tiers (Basic default), and first-run onboarding defaults (Week/Month lists and seeded routine instructions). The project is currently blocked by bootstrap regressions: quadrant initialization can trap/loop (\"initializing quadrant lists\") due to RBAC/admin coupling and/or non-idempotent seeding, which prevents matrix rendering and downstream task creation.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "InternetIdentityProvider"
      ],
      "description": "Provides a React context around DFINITY AuthClient to load persisted identities, initiate Internet Identity login, and logout/clear identity, exposing login status flags and errors.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-bound canister actor creation and cache invalidation",
      "synonyms": [
        "useActor",
        "actor factory",
        "agent identity binding"
      ],
      "description": "Creates a backend actor using the current identity (or anonymous), caches it with React Query keyed by principal, and invalidates/refetches dependent queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secret token extraction from URL hash with session persistence",
      "synonyms": [
        "getSecretParameter",
        "hash token",
        "sessionStorage secret"
      ],
      "description": "Extracts sensitive parameters from the URL hash fragment, stores them in sessionStorage, and removes them from the URL to reduce leakage; used for admin-token-based access control initialization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control initialization and admin checks (backend)",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "_initializeAccessControlWithSecret",
        "isCallerAdmin"
      ],
      "description": "Motoko authorization mixin initializes per-principal roles using an env-provided admin token and a user-provided secret, and exposes role retrieval, admin checks, and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile fetch/save with onboarding setup form",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "UserProfileSetup"
      ],
      "description": "Supports fetching and saving a per-user profile (name, earningsEnabled, tier) and provides a first-run UI for entering a name and creating a default Basic profile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Backend user initialization (quadrant seeding + default routine seeding)",
      "synonyms": [
        "getOrCreateUserInternal",
        "initializeAllQuadrantsInternal",
        "seedIdempotentDefaultRoutines"
      ],
      "description": "Backend constructs a new user state on first access and ensures quadrant lists exist; it idempotently seeds default morning/evening routines when the user has no routines.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Eisenhower matrix UI with quadrant readiness placeholder",
      "synonyms": [
        "Daily Priorities",
        "EisenhowerMatrix",
        "2×2 quadrant board"
      ],
      "description": "Renders a collapsible 2×2 quadrant grid; shows a stable loading/placeholder state when fewer than four quadrants are available; supports drop targets for tasks and a Plan button to switch modes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Custom lists board UI (Plan mode)",
      "synonyms": [
        "CustomLists",
        "My Lists board"
      ],
      "description": "Displays non-quadrant lists as horizontally scrollable columns with internal scrolling, supports quick-add per list, and allows list deletion with confirmation when tasks exist.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Task card UI with long-press edit mode and drag-and-drop",
      "synonyms": [
        "TaskCard",
        "mobile drag",
        "press-and-hold to drag"
      ],
      "description": "Task cards support completion toggling, a long-press edit/drag mode, desktop HTML5 drag, and touch-based drop targeting using elementFromPoint. Includes an isLongTask badge and truncation with full-title tooltip.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Stable drag payload serialization",
      "synonyms": [
        "writeDragPayload",
        "readDragPayload",
        "custom MIME type"
      ],
      "description": "Serializes drag payload JSON into DataTransfer using a custom MIME type with text/plain fallback and robust parsing/validation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Universal Add Task dialog (quadrant prediction + add to custom lists)",
      "synonyms": [
        "UniversalAddTaskDialog",
        "Add task modal"
      ],
      "description": "Unified task creation modal with a Quadrant tab (urgent/important/long-task toggles with predicted quadrant) and an Other Lists tab (select a custom list; urgent forced false). Supports preselecting a list when opened from a list column.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Edit Task dialog with list-aware constraints",
      "synonyms": [
        "EditTaskDialog",
        "task property editor"
      ],
      "description": "Edits title/description/list assignment and flags; communicates constraints for quadrant lists vs custom lists (urgent disabled for custom lists) and includes a Completed toggle in the UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Create List dialog",
      "synonyms": [
        "CreateListDialog",
        "new list modal"
      ],
      "description": "Modal dialog for creating a custom list with validation and loading state handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Morning/evening routine UI (complete, add, delete, reorder)",
      "synonyms": [
        "MorningRoutine",
        "Evening routine",
        "routine reorder mode"
      ],
      "description": "Collapsible routine sections with add dialog, completion toggles, delete confirmation, and long-press activated reorder mode supporting mouse and touch drag interactions. Includes a two-column display mode toggle.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "React Query hook layer for backend domain operations",
      "synonyms": [
        "useQueries",
        "data hooks"
      ],
      "description": "Provides a central set of React Query hooks for profiles, admin state, tasks/lists, routines, and monetary/spend data with consistent query keys, invalidation patterns, and selective optimistic updates (e.g., completion and reordering).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Workspace bootstrap flow in TaskManager",
      "synonyms": [
        "quadrant bootstrap",
        "initialization state machine"
      ],
      "description": "TaskManager coordinates authentication gating, profile setup gating, and a bounded-retry quadrant bootstrap step followed by a daily reset call, with loading screens and a single user-friendly failure toast.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Settings dialog for earnings configuration (UI + validation)",
      "synonyms": [
        "SettingsDialog",
        "monetary settings"
      ],
      "description": "Configures Max Money Per Day and bucket distribution via sliders, validates bucket totals, and includes an earnings enable/disable toggle with a configuration prompt when enabling with a zero max value.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Today Earns calculation UI",
      "synonyms": [
        "TodayEarnsDialog",
        "daily income breakdown"
      ],
      "description": "Calculates and displays a daily earnings breakdown from completed quadrant tasks and routines using bucket caps; allows submitting payroll and opening payroll history.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Payroll history UI (view, edit, submit)",
      "synonyms": [
        "PayrollHistoryDialog",
        "payroll log editor"
      ],
      "description": "Displays payroll records sorted by date, supports inline editing of totals for unsubmitted entries, and provides a submit action with toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Spend plan UI with presets and confirmation flow",
      "synonyms": [
        "SpendPlanDialog",
        "SpendPreset quick add"
      ],
      "description": "Tracks spend records with categories (including a pre-deducted type), supports quick-add presets, preset CRUD UI, and a confirmation dialog before creating a spend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Insights dialog (Spend Insights)",
      "synonyms": [
        "InsightsDialog",
        "Recharts spend chart"
      ],
      "description": "Provides a modal with Spend Insights including daily/weekly/all-time filtering, aggregation of spend totals by date, a bar chart visualization, summary tiles, and a balance status indicator.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Bottom navigation with gestures and mode switching UI",
      "synonyms": [
        "BottomNavigation",
        "swipe-up menu",
        "long-press to Plan"
      ],
      "description": "Implements a fixed bottom navigation with quick tap to add, swipe-up to reveal an action menu, long-press to switch to Plan mode, and a Plan-mode exit button.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Theme toggle (light/dark) with next-themes",
      "synonyms": [
        "ThemeToggle",
        "dark mode"
      ],
      "description": "Toggles light/dark themes using next-themes with class-based theming and animated sun/moon icons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Offline indicator overlay",
      "synonyms": [
        "OfflineIndicator",
        "navigator.onLine guard"
      ],
      "description": "Displays a full-screen overlay when the browser reports offline status, blocking app interaction until connectivity returns.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "PWA manifest + service worker offline caching",
      "synonyms": [
        "manifest.json",
        "sw.js",
        "standalone install"
      ],
      "description": "Includes a web app manifest with icons/theme colors and a service worker that caches essential resources and caches fetched responses for offline support.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Admin dashboard UI (search, pagination, promote/demote controls)",
      "synonyms": [
        "AdminDashboardDialog",
        "admin user table"
      ],
      "description": "Admin-only dialog UI to browse users with search and pagination, copy principal IDs, and trigger promote/demote mutations (backend wiring not shown in the canister code provided).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Local wrapper types for stable React keys",
      "synonyms": [
        "LocalTask",
        "LocalList"
      ],
      "description": "Adds deterministic localId fields to backend Task/List objects for stable React rendering and provides helpers to convert between backend and local representations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-frontend-make-actor-initialization-resilient-when-no-admin-secret-is-present-by-preventing-bootstrap-from-failing-due-to-access-control-secret-initialization-errors-the-app-must-still-allow-standard-non-admin-users-to-log-in-and-initialize-their-workspace",
      "title": "Frontend: Make actor initialization resilient when no admin secret is present by preventing bootstrap from failing due to access-control secret initialization errors; the app must still allow standard (non-admin) users to log in and initialize their workspace.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-frontend-ensure-the-quadrant-bootstrap-flow-reliably-transitions-out-of-the-loading-state-when-the-backend-successfully-returns-4-quadrants-if-quadrant-creation-fails-show-a-single-actionable-english-error-and-allow-retry-via-refresh-without-looping",
      "title": "Frontend: Ensure the quadrant bootstrap flow reliably transitions out of the loading state when the backend successfully returns 4 quadrants; if quadrant creation fails, show a single actionable English error and allow retry via refresh without looping.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix quadrant bootstrap so all users (fresh accounts) can initialize 4 per-user quadrant lists idempotently without any admin/RBAC dependency; unblock matrix rendering and task creation.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Admin Dashboard as a dedicated page with user table columns [Username][Principal ID copy][Email][Tier dropdown][Role][Actions] plus search and pagination; first user admin bootstrap; max 3 admins; (optional) demotion voting workflow.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "User identity/profile enhancements: require unique username, collect/edit email, display tier (Basic default) and allow admin tier assignment.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "First-run onboarding defaults for all new users: create default custom lists Week/Month once; seed Morning/Evening routine instruction items with exact provided text and correct ordering/IDs, using a bootstrap-safe seeding approach that behaves like manually created routines.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Earnings/Cash Flow UX split and gating: separate Settings (monetary buckets) vs Today Earns/Submit Payroll; earningsEnabled toggle that prompts for MaxMoneyPerDay+buckets before enabling; persist settings per user.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Payroll Phase 2 completion: persist todayEarns, payrollHistory logs, one-submit-per-day enforcement, edit/submit unsubmitted logs, correct balance updates with decimal precision.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Spend Plan: phase 1/2 spending tracker with categories (including Pre-deducted non-deduct), quick-add presets (customizable), compact custom spend row, confirmation before add, and Spend Insights integration.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Insights Hub popup with tabs (Spend/Earn/Task) starting with Spend Insights charts; later expand to earn/task analytics.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Bottom navigation/expand menu interaction improvements: consistent open/close gestures across mobile (swipe up) and desktop (click-drag), glass shine effects, plus/X separation by mode, and stable Plan entry/exit behavior.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "PWA polish: manifest/icons/offline screen and consistent theming (green-blue gradient) across app.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Backend: Add idempotent, per-user quadrant initialization endpoints so that a newly authenticated user can always obtain exactly 4 quadrant lists (IDs 1–4) without requiring admin privileges or any RBAC/admin-secret dependency.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Backend: Implement the list read endpoint used by the frontend bootstrap so the frontend can reliably verify quadrant readiness (i.e., return all user lists including quadrants).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-13",
      "summary": "Backend: Remove the fresh-user deadlock where user/quadrant seeding is only reachable after passing an RBAC check; ensure that fresh authenticated users can be granted/recognized as a normal \"user\" (non-admin) and proceed with profile + data initialization without requiring an admin token.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is React + TypeScript using TailwindCSS and shadcn/ui components; most flows are modal/dialog-driven and mobile-first.",
    "State/data fetching is centralized with @tanstack/react-query; query keys are consistent and mutations often invalidate or optimistically patch cached data.",
    "Authentication uses DFINITY Internet Identity via AuthClient; an InternetIdentityProvider exposes identity and login status flags to the app.",
    "A per-identity backend actor is created with agent identity binding; on actor creation, the frontend calls a backend access-control initialization method using a secret token extracted from the URL hash.",
    "Backend authorization is implemented via an AccessControl module and included into the main actor using a Motoko mixin (MixinAuthorization).",
    "Backend user initialization logic (getOrCreateUserInternal) seeds the 4 quadrant lists and default routines idempotently and stores per-user state in in-memory Map structures.",
    "Drag-and-drop supports desktop HTML5 DataTransfer and mobile/touch drop targeting using elementFromPoint; a custom MIME type with text/plain fallback is used for stability.",
    "PWA support includes a web manifest and a custom service worker implementing a network-first strategy with caching.",
    "Bootstrap currently depends on per-user seeding (quadrants/routines/lists) and is sensitive to RBAC/role-assignment side effects; initialization endpoints must be idempotent and callable by any authenticated user without admin privileges.",
    "Plan/Home mode switching and bottom-nav expand state should be decoupled from persisted backend fields to avoid state-collision flicker."
  ],
  "known_issues": [
    "Backend main canister (backend/main.mo) does not implement most of the task/list/routine/monetary/spend endpoints that the frontend calls (e.g., getAllTasks, createTask, getAllLists, createMorningRoutine, getMonetarySettings). The frontend suppresses type errors with @ts-ignore and uses optional chaining, which can make features appear present in UI but not function end-to-end.",
    "Frontend creates an anonymous actor and still enables some user-only queries (e.g., getCallerUserProfile) when not authenticated; the backend will trap with Unauthorized for anonymous callers, producing query errors before login.",
    "backend/main.mo exposes updateUserData but it contains `assert false` and is unusable; any future wiring to this endpoint will trap.",
    "All backend state (usersOld, userProfiles, accessControlState) is held in non-stable variables; data will be lost on canister upgrade unless stable storage is added.",
    "Service worker caches every successful fetch (cache.put for any request) with no allowlist/eviction policy, risking unbounded cache growth and caching of dynamic/authenticated responses.",
    "Environment dependency: _initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set, which can prevent the app from functioning in misconfigured deployments.",
    "Two different global CSS files are present in the repository listing (frontend/index.css and frontend/src/index.css) with different theme token sets; this can cause styling inconsistencies depending on which one is actually imported/bundled.",
    "Some UI flows (earnings, payroll, spend tracking, insights) assume particular units/precision (e.g., dollars vs cents) but the backend types store monetary fields as Nat/Int/Float without an explicit shared contract in the shown code, increasing risk of display/calculation mismatches.",
    "Fresh users can get stuck at \"initializing quadrant lists\"; bootstrapQuadrants throws \"Failed to initialize all quadrants\" and/or Unauthorized errors when quadrant initialization is coupled to admin-only role assignment. This blocks matrix rendering and downstream flows (e.g., Add Task).",
    "Payroll submission frequently fails with errors like \"No earnings data available for this date\" / \"No active earnings for today\" despite Today Earns displaying, indicating backend validation/state persistence mismatch between todayEarns and submitPayrollLog.",
    "Onboarding/seeded routines may not behave like manually created routines (unstable ordering/IDs, cannot delete, checkbox state reverts) if seeding uses a different data path than manual creation."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Momentum",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}