{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Momentum is a mobile-first personal productivity PWA with a React/TypeScript frontend and an Internet Computer (ICP) Motoko canister backend. Users authenticate via Internet Identity, manage tasks through a Daily Priorities Eisenhower Matrix (four fixed quadrant lists) plus custom lists with drag-and-drop and reordering, and manage morning/evening routine items with streaks and reorder mode. An optional tier-gated “earnings” system lets users configure daily monetary targets and bucket allocations, compute “Today Earns”, submit payroll, view/edit payroll history, and track spending with reusable presets. Admins can view a user directory, promote/demote admins, and set user tiers (Basic/Silver/Gold/Diamond).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "InternetIdentityProvider"
      ],
      "description": "Provides an auth context around @dfinity/auth-client to initialize and load any stored delegation identity, perform Internet Identity login with a 30-day TTL, and logout/clear identity state with status flags for UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-bound backend actor creation and query cache reset",
      "synonyms": [
        "useActor",
        "actor factory",
        "agent identity binding"
      ],
      "description": "Creates an anonymous actor when logged out and an authenticated actor when logged in (agentOptions.identity). Actor creation is cached by principal and triggers invalidation/refetch of other React Query caches when identity changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secret admin token retrieval from URL hash with session persistence",
      "synonyms": [
        "getSecretParameter",
        "hash secret",
        "sessionStorage token"
      ],
      "description": "Reads sensitive parameters from the URL hash fragment, persists them in sessionStorage, and removes them from the address bar to reduce leakage (used for admin bootstrap secret).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control bootstrap (Motoko)",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "_initializeAccessControlWithSecret"
      ],
      "description": "Implements RBAC with roles (#guest/#user/#admin). Initialization can promote the first caller to admin when a provided secret matches the CAFFEINE_ADMIN_TOKEN env var; other new callers become #user.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Admin checks and role assignment APIs",
      "synonyms": [
        "isCallerAdmin",
        "getCallerUserRole",
        "assignCallerUserRole"
      ],
      "description": "Backend exposes query APIs to check caller role/admin status and a shared API to assign roles (admin-only enforcement server-side).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User profiles (name/email/tier/earningsEnabled)",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile"
      ],
      "description": "Stores and retrieves a per-user profile including name, optional email, tier, and earningsEnabled. Profile saves preserve tier/earningsEnabled from the existing profile to prevent self-escalation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "First-run profile onboarding (name + email)",
      "synonyms": [
        "UserProfileSetup",
        "onboarding"
      ],
      "description": "When a user has no profile, the UI prompts for name and validated email and saves a default profile (Basic tier, earnings disabled).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Tier system and tier label utilities",
      "synonyms": [
        "UserTier",
        "getUserTierLabel",
        "getAllTiers"
      ],
      "description": "Defines tiers (Basic/Silver/Gold/Diamond) and provides frontend helpers to render tier labels and populate tier selection controls.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Tier-based limits and user-friendly tier error messages",
      "synonyms": [
        "tier limits",
        "parseTierError",
        "upgrade prompts"
      ],
      "description": "Backend enforces tier limits for max tasks, max routines, max custom lists, and earnings availability; frontend parses trap messages into clear user-facing toast errors.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Admin user directory with promotion/demotion and tier management",
      "synonyms": [
        "AdminDashboardDialog",
        "getAllUserMetadataWithRoles",
        "promoteToAdmin",
        "removeAdmin",
        "setUserTier"
      ],
      "description": "Admins can view/search/paginate users, copy principal IDs, promote/demote admins (max 3; cannot remove last admin), and change user tier via admin-only mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Quadrant list initialization and readiness gating",
      "synonyms": [
        "ensureAllQuadrants",
        "quadrantsReady",
        "bootstrapQuadrants"
      ],
      "description": "Backend idempotently ensures the 4 Eisenhower quadrant lists per user. Frontend provides a bounded-retry bootstrap helper and gates quadrant-based task creation until all 4 lists exist.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Tasks and lists CRUD with reordering and moving",
      "synonyms": [
        "useTaskQueries",
        "getAllTasks",
        "getAllLists",
        "moveTask",
        "updateTaskPosition"
      ],
      "description": "Fetches all tasks and lists and provides mutations for creating/updating/deleting tasks, completing tasks, moving tasks between lists, reordering tasks, and creating/deleting custom lists with cache invalidation and selective optimistic updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Universal Add Task dialog (quadrant prediction + custom list add)",
      "synonyms": [
        "UniversalAddTaskDialog",
        "priority toggles",
        "preselected list"
      ],
      "description": "Unified add-task modal with Quadrant and Other Lists tabs, Important/Urgent/Long Task toggles, real-time predicted destination quadrant, warning when quadrants are not ready, and optional pre-selected custom list destination.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Edit Task dialog with quadrant/custom-list constraints",
      "synonyms": [
        "EditTaskDialog",
        "task editor"
      ],
      "description": "Edits title/description/list and flags with UX constraints: quadrant tasks treat urgent/important as derived from quadrant; custom list tasks force urgent=false and allow important/long-task toggles; includes a completed toggle (backend updateTask limitation noted separately).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Eisenhower Matrix UI with drag-and-drop",
      "synonyms": [
        "Daily Priorities",
        "EisenhowerMatrix",
        "2×2 board"
      ],
      "description": "Renders a collapsible 2×2 quadrant grid showing tasks by quadrant with desktop HTML5 drag-and-drop and drop zones, including an initializing placeholder when quadrant lists are missing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Custom lists board (Plan mode) with touch/desktop DnD",
      "synonyms": [
        "CustomLists",
        "My Lists",
        "horizontal columns"
      ],
      "description": "Displays non-quadrant lists as horizontally scrollable columns, supports quick-add per list, list deletion (with confirmation when tasks exist), and drag/drop + reordering of tasks with mobile long-press edit mode.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Mobile long-press edit mode for tasks",
      "synonyms": [
        "TaskCard edit mode",
        "touch drag"
      ],
      "description": "Task cards enter a drag/edit mode via long-press (mouse or touch), showing drag handle and edit/delete/exit controls; touch-based dragging uses elementFromPoint to detect drop targets.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Morning & evening routines with streaks and reorder mode",
      "synonyms": [
        "MorningRoutine",
        "Evening routine",
        "streakCount",
        "long-press reorder"
      ],
      "description": "Allows adding/completing/deleting routine items in top/bottom sections, visualizes streak milestones, supports single/dual-column display mode, and enables long-press reorder mode with mouse/touch drag-and-drop and a Done button.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Daily reset / new day rollover",
      "synonyms": [
        "resetNewDay",
        "performRoutineDailyResetIfNeeded"
      ],
      "description": "Backend supports daily rollover: moves unsubmitted Today Earns into payroll history, clears quadrant tasks, resets routines (updating streaks/weights), and clears todayEarns; frontend runs bootstrap + reset during workspace initialization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Home vs Plan app modes with gesture-based bottom navigation",
      "synonyms": [
        "appMode",
        "BottomNavigation",
        "swipe-up menu",
        "long-press Plan"
      ],
      "description": "Implements Home and Plan modes controlled via a bottom navigation bar: quick tap adds a task, swipe up opens a menu, long-press enters Plan mode; Plan mode exposes Add Task/Add List actions and a layout-only X toggle.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Earnings system toggle and monetary settings",
      "synonyms": [
        "earningsEnabled",
        "toggleEarningsSystem",
        "MonetarySettings"
      ],
      "description": "Users can enable/disable monetary features (tier-restricted). Monetary settings include maxMoneyPerDay and bucket allocations (morning/priorities/evening) validated to sum correctly; settings are saved to the backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Today Earns computation and payroll submission",
      "synonyms": [
        "TodayEarnsDialog",
        "Daily Priorities earnings",
        "addPayroll"
      ],
      "description": "Calculates daily income from routines plus Daily Priorities (using quadrant planned-weight scaling) and allows submitting payroll to update total balance and access payroll history.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Payroll history view, edit, and submit",
      "synonyms": [
        "PayrollHistoryDialog",
        "getPayrollHistory",
        "submitPayrollLog",
        "editPayrollLog"
      ],
      "description": "Shows payroll records sorted by date with totals and breakdowns; allows editing unsubmitted records and submitting them to apply to the running balance.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Spend tracking with presets and confirmation flow",
      "synonyms": [
        "SpendPlanDialog",
        "SpendRecord",
        "SpendPreset",
        "pre-deducted"
      ],
      "description": "Tracks spend records, supports normal vs pre-deducted spends, confirms spend creation, updates balance for normal spends, supports deletion with balance adjustment, and provides preset CRUD with quick-add UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Insights hub (Spend Insights v1)",
      "synonyms": [
        "InsightsDialog",
        "spend chart",
        "time period selector"
      ],
      "description": "Provides an insights dialog with Spend Insights (daily/weekly/all-time aggregation and bar chart). Earning and Task insights tabs are present but disabled.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Plan mode one-time instruction tip",
      "synonyms": [
        "PlanModeTipDialog",
        "plan mode tips",
        "first-time popup"
      ],
      "description": "Shows a single-card instruction popup the first time a user enters Plan mode (custom lists layout), explaining drag-and-drop and ending with the exact text: \"The Real Magic Is in Settings.\"",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Persisted plan-mode tip dismissal",
      "synonyms": [
        "usePlanModeTip",
        "planModeTipShown",
        "localStorage persistence"
      ],
      "description": "Persists whether the Plan mode tip has been shown using localStorage so it only appears once across reloads and app restarts.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "PWA support and offline UX",
      "synonyms": [
        "manifest",
        "service worker",
        "OfflineIndicator"
      ],
      "description": "Includes a PWA manifest (standalone, icons, portrait orientation) and a service worker with network-first caching and offline navigation fallback, plus a fullscreen offline overlay when the browser is offline.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Theme toggle (light/dark)",
      "synonyms": [
        "ThemeToggle",
        "next-themes"
      ],
      "description": "Supports light/dark theme switching using next-themes with Tailwind design tokens and global styling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Stable drag payload utilities",
      "synonyms": [
        "dragPayload",
        "DataTransfer MIME fallback"
      ],
      "description": "Writes/reads drag payloads using a custom MIME type with text/plain fallback for more reliable drag-and-drop across browsers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-plan-mode-tip-persistence-logic-so-the-plan-mode-tips-instruction-dialog-is-tracked-per-authenticated-user-keyed-by-the-user-s-internet-identity-principal-rather-than-a-single-shared-localstorage-key-for-the-whole-browser-device",
      "title": "Update the Plan Mode tip persistence logic so the “Plan Mode Tips” instruction dialog is tracked per authenticated user (keyed by the user’s Internet Identity principal) rather than a single shared localStorage key for the whole browser/device.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-client-side-migration-fallback-so-existing-users-who-previously-dismissed-the-plan-mode-tip-under-the-old-shared-localstorage-key-keep-it-dismissed-for-their-own-account-after-upgrading-without-affecting-other-users-on-the-same-device",
      "title": "Add a client-side migration/fallback so existing users who previously dismissed the Plan Mode tip under the old shared localStorage key keep it dismissed for their own account after upgrading (without affecting other users on the same device).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Make 4-step onboarding instructions persist per-user (not per-device localStorage) so each new user sees the tips after registration",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is React + TypeScript with TailwindCSS and shadcn/ui; most interactions are implemented as modal dialogs and collapsible panels.",
    "Data fetching/mutations are centralized in @tanstack/react-query hooks; cache invalidation and optimistic updates are used for responsiveness (notably for task/routine completion and reordering).",
    "Authentication uses @dfinity/auth-client via an InternetIdentityProvider context; identity changes rebuild the canister actor and invalidate/refetch dependent queries.",
    "Backend is a single Motoko canister storing per-user state in in-memory Maps keyed by Principal (lists, tasks, routines, payroll, spends, presets, settings) plus a separate userProfiles map.",
    "Authorization is RBAC via an AccessControl module mixed in with MixinAuthorization; first-time bootstrap can assign the first admin via a secret compared against an env var token.",
    "Eisenhower strategy: quadrant lists are ensured per user with fixed IDs 1–4 and are treated as immutable “quadrant” lists; custom lists are created starting at ID 5.",
    "Ordering strategy: tasks and routine items use sparse integer ordering (START_OFFSET=1000) with midpoint insertion; backend can renormalize when ordering gaps collapse.",
    "Mobile-first UX: long-press enables drag/edit/reorder modes; desktop uses HTML5 drag-and-drop; touch drop uses elementFromPoint targeting.",
    "PWA support includes manifest + service worker (network-first caching + offline navigation fallback) and a dedicated offline overlay.",
    "Tier system is enforced in backend mutation points (task/routine/custom list creation and enabling earnings); frontend parses tier-limit traps into user-facing messages."
  ],
  "known_issues": [
    "Canister state is not persisted in stable variables; most user data will be lost on canister upgrade/reinstall (no stable serialization for core Maps).",
    "Monetary units are inconsistent between UI and backend: payroll/history uses Int and some UI divides by 100, while spends use Float and balance updates use toInt truncation—risking incorrect balances/rounding.",
    "Backend updateTask ignores the incoming `completed` field (it preserves the old value); editing “Completed” via updateTask cannot persist and must use completeTask.",
    "Service worker caches every successful fetch response (including dynamic/authenticated requests) without allowlist/eviction, risking unbounded cache growth and stale/private caching.",
    "Actor initialization always calls `_initializeAccessControlWithSecret`; if CAFFEINE_ADMIN_TOKEN is missing, the canister traps and the app becomes unusable.",
    "AccessControl.getUserRole traps \"User is not registered\" until initialization is performed; correct operation depends on frontend always calling the initializer first.",
    "AdminDashboardDialog uses useMemo for a state-setting side effect (page clamping); should be useEffect to avoid unexpected render behavior.",
    "InsightsDialog sorts buckets by constructing Date from locale-formatted strings (e.g., \"Jan 2\"), which can mis-sort across locales/years.",
    "Some UI state is stored only in React Query cache (e.g., appMode, routines displayMode) and resets on reload (not persisted).",
    "frontend/src/components/CreateTaskDialog.tsx and frontend/src/components/MonetarySettingsDialog.tsx are empty placeholders in this snapshot (dead/unused components)."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Momentum",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}