{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Routine tracking app with strike count system. Features two reset modes: Next Day Reset (increments checked routines, resets unchecked to 0) and Skipped Day Reset (resets all to 0). Start new day button in header opens popup with both reset options.",
  "architectural_notes": [
    "Frontend displays strike count preview: +1 when checked, current count when unchecked (no backend calls)",
    "Backend updates only triggered by reset buttons in Start new day popup",
    "Multi-device sync for routine check status across user devices",
    "Next Day Reset: checked routines increment strike count by 1, unchecked reset to 0, all checkboxes uncheck",
    "Skipped Day Reset: all strike counts reset to 0, all checkboxes uncheck"
  ],
  "known_issues": [
    "Strike count not updating properly after Next Day Reset or Skipped Day Reset - only works correctly on first routine creation"
  ],
  "isFixRequest": true,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix the backend strike count update logic in the nextDayReset function so that when 'Next Day Reset' is clicked, checked routines increment their strike count by 1 and unchecked routines reset their strike count to 0, with all checkboxes unchecked after the operation",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix the backend strike count update logic in the skippedDayReset function so that when 'Skipped Day Reset' is clicked, all routine strike counts reset to 0 and all checkboxes are unchecked",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Preserve the existing frontend preview behavior where checking a routine shows strike count + 1 in the badge and unchecking shows the current strike count, with no backend calls during check/uncheck actions",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Routine Tracker",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}